{
  "version": "3.0",
  "lastVerified": "2026-03-01",
  "nextReviewDate": "2026-09-01",
  "sources": [
    "Regulation (EU) 2022/2554 (DORA) — EUR-Lex, entered into force 17 January 2025",
    "Commission Delegated Regulation (EU) 2024/1774 — RTS on ICT Risk Management Framework (Art.15)",
    "Commission Delegated Regulation (EU) 2024/1772 — RTS on Classification of Major ICT Incidents (Art.18)",
    "EBA/ESMA/EIOPA ITS on Major Incident Reporting Templates and Timelines (Art.20)",
    "Joint Committee Final Report JC 2023 86 — RTS on Threat-Led Penetration Testing (Art.26-27)",
    "EBA Final Report EBA/RTS/2024/05 — RTS on ICT Third-Party Risk Management (Art.28-30)",
    "EBA ITS on Register of Information (Art.28(3)) — EBA Master Template"
  ],
  "articles": [
    {
      "regulation": "DORA",
      "article": "Article 1",
      "title": "Subject Matter",
      "domain": "General Provisions",
      "text": "This Regulation lays down uniform requirements concerning the security of network and information systems supporting the business processes of financial entities as follows:\n\n(a) requirements applicable to financial entities in relation to:\n(i) information and communication technology (ICT) risk management;\n(ii) reporting of major ICT-related incidents and notifying, on a voluntary basis, significant cyber threats to competent authorities;\n(iii) reporting of major operational or security payment-related incidents to competent authorities;\n(iv) digital operational resilience testing;\n(v) information and intelligence sharing in relation to cyber threats and vulnerabilities;\n(vi) measures for the sound management of ICT third-party risk;\n\n(b) requirements in relation to the contractual arrangements between ICT third-party service providers and financial entities;\n\n(c) rules on the establishment and conduct of the Oversight Framework for critical ICT third-party service providers when providing services to financial entities;\n\n(d) rules on cooperation among competent authorities, and rules on supervision and enforcement by competent authorities in relation to all matters covered by this Regulation.",
      "obligations": [
        "Comply with ICT risk management requirements",
        "Report major ICT-related incidents to competent authorities",
        "Voluntarily notify significant cyber threats to competent authorities",
        "Report major operational or security payment-related incidents",
        "Conduct digital operational resilience testing",
        "Participate in information and intelligence sharing on cyber threats",
        "Manage ICT third-party risk according to prescribed requirements",
        "Ensure contractual arrangements with ICT third-party providers comply with regulatory requirements"
      ]
    },
    {
      "regulation": "DORA",
      "article": "Article 2",
      "title": "Scope",
      "domain": "General Provisions",
      "text": "1. This Regulation applies to the following entities:\n(a) credit institutions;\n(b) payment institutions, including payment institutions exempted pursuant to Directive (EU) 2015/2366;\n(c) account information service providers;\n(d) electronic money institutions;\n(e) investment firms;\n(f) crypto-asset service providers and issuers of asset-referenced tokens;\n(g) central securities depositories;\n(h) central counterparties;\n(i) trading venues;\n(j) trade repositories;\n(k) managers of alternative investment funds;\n(l) management companies;\n(m) data reporting service providers;\n(n) insurance and reinsurance undertakings;\n(o) insurance intermediaries, reinsurance intermediaries and ancillary insurance intermediaries;\n(p) institutions for occupational retirement provision;\n(q) credit rating agencies;\n(r) administrators of critical benchmarks;\n(s) crowdfunding service providers;\n(t) securitisation repositories;\n(u) ICT third-party service providers.\n\n2. For the purposes of this Regulation, entities referred to in paragraph 1, points (a) to (t), are referred to as 'financial entities'.\n\n3. This Regulation does not apply to:\n(a) managers of alternative investment funds referred to in Article 3(2) of Directive 2011/61/EU;\n(b) insurance and reinsurance undertakings referred to in Article 4 of Directive 2009/138/EC;\n(c) institutions for occupational retirement provision which operate pension schemes which together have less than 15 members in total;\n(d) natural or legal persons exempted pursuant to Articles 2 and 3 of Directive 2014/65/EU;\n(e) insurance intermediaries, reinsurance intermediaries and ancillary insurance intermediaries which are microenterprises or small or medium-sized enterprises;\n(f) post office giro institutions.",
      "obligations": [
        "Identify whether the entity falls within DORA scope",
        "Apply DORA requirements across credit institutions, payment institutions, investment firms, insurance undertakings and other financial entities",
        "ICT third-party service providers subject to oversight framework provisions",
        "Verify applicability of exemptions for microenterprises and specified categories"
      ]
    },
    {
      "regulation": "DORA",
      "article": "Article 3",
      "title": "Definitions",
      "domain": "General Provisions",
      "text": "For the purposes of this Regulation, the following definitions apply:\n\n'digital operational resilience' means the ability of a financial entity to build, assure and review its operational integrity and reliability by ensuring, either directly or indirectly through the use of services provided by ICT third-party service providers, the full range of ICT-related capabilities needed to address the security of the network and information systems which a financial entity uses, and which support the continued provision of financial services and their quality.\n\n'ICT risk' means any reasonably identifiable circumstance in relation to the use of network and information systems, which, if materialised, may compromise the security of the network and information systems, of any technology-dependent tool or process, of operations and processes, or of the provision of services, by producing adverse effects in the digital or physical environment.\n\n'ICT-related incident' means an unplanned event or series of related events that compromises the security of the network and information systems, and has an adverse impact, or is likely to have an adverse impact, on the availability, authenticity, integrity or confidentiality of data.\n\n'major ICT-related incident' means an ICT-related incident that has a high adverse impact on the network and information systems that support critical or important functions of the financial entity.\n\n'significant cyber threat' means a cyber threat with the technical characteristics of a cyber threat that is likely to have severe impacts on the network and information systems of a financial entity.\n\n'critical or important function' means a function whose disruption would materially impair the financial performance of a financial entity, or the soundness or continuity of its services and activities.\n\n'ICT third-party service provider' means an undertaking providing digital and data services to one or more financial entities, including cloud computing service providers, software, data analytics services, data centres, and any other undertaking providing a digital service.\n\n'critical ICT third-party service provider' means an ICT third-party service provider that has been designated as critical in accordance with Article 31.\n\n'ICT services' means digital and data services provided through ICT systems to one or more internal or external users on an ongoing basis.\n\n'ICT risk management framework' means the system of tools, methods, processes and policies addressing ICT risk.\n\n'threat-led penetration testing' (TLPT) means a framework that mimics the tactics, techniques and procedures of real-life threat actors perceived as posing a genuine cyber threat, and delivers a controlled, bespoke, intelligence-led penetration test on the live production systems of the financial entity.\n\n'concentration risk' means exposure to one or more ICT third-party service providers creating a degree of dependency on such providers so that unavailability, failure or other shortfall of that provider may endanger the ability of a financial entity to deliver critical or important functions.",
      "obligations": [
        "Apply regulatory definitions consistently across all DORA compliance activities",
        "Identify critical or important functions subject to heightened requirements",
        "Classify ICT-related incidents using regulatory definitions",
        "Distinguish between ICT-related incidents, major ICT-related incidents and significant cyber threats",
        "Apply concentration risk definition when assessing third-party dependencies",
        "Identify ICT third-party service providers within scope of third-party risk management requirements"
      ]
    },
    {
      "regulation": "DORA",
      "article": "Article 4",
      "title": "Proportionality Principle",
      "domain": "General Provisions",
      "text": "1. Financial entities shall implement the rules laid down in Chapter II in accordance with the principle of proportionality, taking into account their size and overall risk profile, and the nature, scale and complexity of their services, activities and operations.\n\n2. In addition, the application by financial entities of Chapters III, IV and V shall be proportionate to their size and overall risk profile, and the nature, scale and complexity of their services, activities and operations, as specifically required under the relevant provisions of those Chapters.\n\n3. The competent authorities shall take into account the principle of proportionality when assessing the ICT risk management framework of financial entities on the basis of the reports submitted pursuant to Article 19(1).\n\n4. The ESAs shall develop, through the Joint Committee, draft regulatory technical standards to further specify the elements, the criteria and where applicable the thresholds referred to in this Regulation, having due regard to the size and overall risk profile of financial entities, and the nature, scale and complexity of their activities.",
      "obligations": [
        "Apply ICT risk management proportionately to entity size and risk profile",
        "Apply incident reporting proportionately based on nature, scale and complexity of activities",
        "Apply resilience testing proportionately based on entity characteristics",
        "Apply third-party risk management proportionately",
        "Microenterprises may follow simplified obligations specified in relevant articles",
        "Document proportionality reasoning when applying simplified approaches"
      ]
    },
    {
      "regulation": "DORA",
      "article": "Article 5",
      "title": "Governance and Organisation",
      "domain": "ICT Risk Management",
      "text": "1. Financial entities shall establish governance and control frameworks ensuring effective ICT risk management to achieve a high level of digital operational resilience.\n\n2. The management body shall define, approve, oversee and be responsible for implementing ICT risk management arrangements. In doing so, they shall:\n\n(a) bear ultimate responsibility for managing ICT risk;\n(b) establish policies ensuring high standards of availability, authenticity, integrity and confidentiality of data;\n(c) set clear roles and responsibilities for ICT functions with effective governance arrangements;\n(d) set and approve the digital operational resilience strategy, including ICT risk tolerance levels;\n(e) approve and review ICT business continuity policy and response and recovery plans;\n(f) approve and review ICT internal audit plans and material modifications;\n(g) allocate appropriate budgets for digital resilience needs, including security awareness and staff training;\n(h) approve and review policy on ICT third-party service provider arrangements;\n(i) establish reporting channels regarding: third-party arrangements, planned material changes, impact assessments, and ICT incidents.\n\n3. Non-microenterprises must establish a dedicated role or designate senior management to monitor third-party ICT service provider arrangements.\n\n4. Management body members must actively keep up to date with sufficient knowledge and skills regarding ICT risk through regular training.",
      "obligations": [
        "Establish governance and control frameworks for effective ICT risk management",
        "Management body bears ultimate responsibility for managing ICT risk",
        "Establish policies ensuring high standards of data availability, authenticity, integrity and confidentiality",
        "Set clear roles and responsibilities for ICT functions",
        "Set and approve digital operational resilience strategy including ICT risk tolerance levels",
        "Allocate appropriate budgets for digital resilience, security awareness and staff training",
        "Approve and review ICT third-party service provider policies",
        "Establish reporting channels for third-party arrangements, material changes, impact assessments and incidents",
        "Designate dedicated senior management role to monitor third-party providers",
        "Management body maintains sufficient knowledge and skills in ICT risk through regular training"
      ]
    },
    {
      "regulation": "DORA",
      "article": "Article 6",
      "title": "ICT Risk Management Framework",
      "domain": "ICT Risk Management",
      "text": "1. Financial entities shall have a sound, comprehensive and well-documented ICT risk management framework as part of their overall risk management system.\n\n2. The framework must include strategies, policies, procedures, ICT protocols and tools protecting information assets, computer software, hardware, servers, physical components, premises, data centres and sensitive areas from risks including damage and unauthorized access.\n\n3. Entities shall minimize ICT risk impact through appropriate strategies, policies, procedures, ICT protocols and tools, providing complete and updated information to competent authorities upon request.\n\n4. Non-microenterprise entities must assign ICT risk management responsibility to a control function with appropriate independence, ensuring proper segregation across the three lines of defence model.\n\n5. The framework requires documented annual reviews (periodic for microenterprises), triggered by major incidents, supervisory instructions, or testing processes, with improvement based on implementation lessons and competent authority reporting.\n\n6. Non-microenterprise frameworks undergo regular internal audits by auditors possessing sufficient knowledge, skills and expertise in ICT risk with appropriate independence, with audit frequency matching the entity's ICT risk level.\n\n7. Entities must establish formal follow-up processes including timely verification and remediation of critical ICT audit findings.\n\n8. The digital operational resilience strategy addresses ICT risk through eight specific points: (a) business alignment; (b) risk tolerance and impact analysis; (c) security objectives with key performance indicators; (d) ICT reference architecture; (e) incident detection mechanisms; (f) resilience documentation; (g) compliance testing; (h) incident communication strategy.\n\n9. Entities may define holistic multi-vendor ICT strategies showing dependencies on third-party service providers.\n\n10. Entities may outsource compliance verification to intra-group or external undertakings while retaining full responsibility for ICT risk management compliance.",
      "obligations": [
        "Establish sound, comprehensive and well-documented ICT risk management framework",
        "Framework must protect information assets from damage and unauthorized access",
        "Minimize ICT risk impact through appropriate strategies, policies, procedures and tools",
        "Provide complete and updated information to competent authorities upon request",
        "Assign ICT risk management to control function with appropriate independence",
        "Conduct documented annual framework reviews",
        "Establish regular internal audits by qualified auditors",
        "Establish formal follow-up processes for critical audit findings",
        "Digital operational resilience strategy must address business alignment, risk tolerance, security objectives, ICT architecture, incident detection, documentation, testing and communication",
        "Retain full responsibility for ICT risk management even when outsourcing compliance verification"
      ]
    },
    {
      "regulation": "DORA",
      "article": "Article 7",
      "title": "ICT Systems, Protocols and Tools",
      "domain": "ICT Risk Management",
      "text": "In order to address and manage ICT risk, financial entities shall use and maintain updated ICT systems, protocols and tools that are:\n\n(a) appropriate to the magnitude of operations supporting the conduct of their activities, in accordance with the proportionality principle as referred to in Article 4;\n(b) reliable;\n(c) equipped with sufficient capacity to accurately process the data necessary for the performance of activities and the timely provision of services, and to deal with peak orders, message or transaction volumes, as needed, including where new technology is introduced;\n(d) technologically resilient in order to adequately deal with additional information processing needs as required under stressed market conditions or other adverse situations.\n\nFinancial entities shall continuously monitor the performance of ICT systems and tools, identify and promptly address all differences between the expected and actual ICT capacity, and establish monitoring mechanisms to assess the quality of ICT services provided by third-party providers. The monitoring shall cover at minimum key performance indicators related to availability, authenticity, integrity and confidentiality, and latency of ICT services.",
      "obligations": [
        "Use and maintain updated ICT systems, protocols and tools appropriate to operational magnitude",
        "Ensure ICT systems are reliable",
        "Ensure ICT systems have sufficient capacity to process data and handle peak volumes",
        "Ensure ICT systems are technologically resilient for adverse conditions",
        "Continuously monitor ICT system and tool performance",
        "Promptly address differences between expected and actual ICT capacity",
        "Establish monitoring mechanisms for third-party ICT service quality",
        "Monitor key performance indicators: availability, authenticity, integrity, confidentiality and latency"
      ]
    },
    {
      "regulation": "DORA",
      "article": "Article 8",
      "title": "Identification",
      "domain": "ICT Risk Management",
      "text": "1. As part of the ICT risk management framework referred to in Article 6(1), financial entities shall identify, classify and adequately document all ICT supported business functions, roles and responsibilities, the information assets and ICT assets, including those located remotely, network resources and hardware equipment, and map those considered critical.\n\n2. Financial entities shall identify all sources of ICT risk, in particular the risk exposure to and from other financial entities, and assess relevant cyber threats and ICT vulnerabilities with respect to the business functions, information assets and ICT assets. Financial entities shall review on a regular basis, and at least yearly, the risk scenarios impacting them.\n\n3. Financial entities, other than microenterprises, shall perform a risk assessment upon each major change in the network and information system infrastructure, in the processes or procedures affecting their business functions, information assets or ICT assets.\n\n4. Financial entities shall identify all information assets and ICT assets, including those with third-party service providers, and map the information assets considered critical. They shall update this mapping regularly and whenever there are major changes to the infrastructure.\n\n5. Financial entities shall maintain and regularly update an inventory of all ICT assets and review ICT risks associated with each ICT asset identified in the inventory.",
      "obligations": [
        "Identify, classify and document all ICT-supported business functions, roles and responsibilities",
        "Identify and document information assets and ICT assets including those held remotely",
        "Map ICT assets and resources considered critical",
        "Identify all sources of ICT risk including from other financial entities",
        "Assess cyber threats and ICT vulnerabilities with respect to business functions and assets",
        "Review risk scenarios at least yearly",
        "Perform risk assessment upon major changes to network and information system infrastructure",
        "Maintain and regularly update an inventory of all ICT assets",
        "Review ICT risks associated with each asset in the inventory",
        "Update asset mapping whenever major infrastructure changes occur"
      ]
    },
    {
      "regulation": "DORA",
      "article": "Article 9",
      "title": "Protection and Prevention",
      "domain": "ICT Risk Management",
      "text": "1. Financial entities must continuously monitor and control the security and functioning of ICT systems and minimize ICT risk impact through appropriate security tools and procedures.\n\n2. Entities shall design, procure and implement ICT security policies, procedures, protocols and tools ensuring resilience, continuity, and availability of ICT systems, maintaining high standards for data availability, authenticity, integrity, and confidentiality.\n\n3. ICT solutions must:\n(a) ensure the security of the means of transfer of data;\n(b) minimize corruption, loss, unauthorized access, and technical flaws;\n(c) prevent the lack of availability, the impairment of the authenticity and integrity;\n(d) protect data from management risks and human error.\n\n4. As part of ICT risk management, entities shall:\n(a) develop and document an information security policy;\n(b) establish network management using appropriate techniques and automated isolation mechanisms;\n(c) implement access limitation policies addressing access rights and ensure a sound administration thereof;\n(d) implement strong authentication and cryptographic keys whereby data is encrypted based on approved cryptographic standards;\n(e) implement documented ICT change management policies including software and firmware changes;\n(f) maintain appropriate and comprehensive documented policies for patches and updates.\n\nNetwork infrastructure must be instantaneously severed or segmented to minimise contagion in the event of a cyber attack. Change management requires appropriate management approval and specific protocols.",
      "obligations": [
        "Continuously monitor and control the security and functioning of ICT systems",
        "Design, procure and implement ICT security policies, procedures, protocols and tools",
        "Ensure security of data transfer means",
        "Minimize corruption, loss, unauthorized access and technical flaws",
        "Prevent lack of availability and impairment of authenticity and integrity",
        "Protect data from management risks and human error",
        "Develop and document an information security policy",
        "Establish network management with appropriate techniques and automated isolation mechanisms",
        "Implement access limitation policies with sound administration",
        "Implement strong authentication and cryptographic encryption for data",
        "Implement documented ICT change management policies",
        "Maintain documented policies for patches and updates",
        "Ensure network infrastructure can be instantaneously severed or segmented"
      ]
    },
    {
      "regulation": "DORA",
      "article": "Article 10",
      "title": "Detection",
      "domain": "ICT Risk Management",
      "text": "1. Financial entities shall have in place mechanisms to promptly detect anomalous activities, in accordance with Article 17, including ICT network performance issues and ICT-related incidents, and to identify potential material single points of failure. Detection mechanisms must be regularly tested in accordance with Article 25.\n\n2. Detection mechanisms should enable multiple layers of control, define alert thresholds and criteria to trigger and initiate ICT-related incident response processes, including automatic alert mechanisms for relevant staff in charge of ICT-related incident response.\n\n3. Financial entities shall devote sufficient resources and capabilities to monitor user activity, the occurrence of ICT anomalies and ICT-related incidents, in particular cyber-attacks.\n\n4. Data reporting service providers shall, in addition, have in place systems that can effectively check trade reports for completeness, identify omissions and obvious errors, and request re-transmission of those reports.",
      "obligations": [
        "Establish mechanisms to promptly detect anomalous activities and ICT-related incidents",
        "Identify potential material single points of failure",
        "Regularly test detection mechanisms",
        "Enable multiple layers of control in detection systems",
        "Define alert thresholds and criteria to trigger incident response processes",
        "Establish automatic alert mechanisms for relevant ICT incident response staff",
        "Devote sufficient resources and capabilities to monitor user activity and ICT anomalies",
        "Monitor ICT-related incidents, particularly cyber-attacks"
      ]
    },
    {
      "regulation": "DORA",
      "article": "Article 11",
      "title": "Response and Recovery",
      "domain": "ICT Risk Management",
      "text": "1. Financial entities shall put in place a comprehensive ICT business continuity policy.\n\n2. Entities must implement policies addressing:\n(a) ensuring the continuity of the financial entity's critical or important functions;\n(b) respond to and resolve ICT-related incidents in a way that limits damage;\n(c) activate, without delay, dedicated plans that enable containment measures;\n(d) estimate preliminary impacts, damages and losses;\n(e) communication ensuring updated information is transmitted to all relevant internal staff.\n\n3. Financial entities must implement associated ICT response and recovery plans.\n\n4. Entities shall maintain and periodically test appropriate ICT business continuity plans, and ICT response and recovery plans.\n\n5. Conduct business impact analysis assessing potential impact of severe business disruptions by means of quantitative and qualitative criteria, including through scenario analyses.\n\n6. Test digital operational resilience plans at least once a year for non-microenterprises, and in the event of any substantive changes to ICT systems supporting critical or important functions.\n\n7. Non-microenterprises shall require a crisis management function, establishing communication and crisis management procedures.\n\n8. Keep readily accessible records of activities before and during disruption events.\n\n9-11. ESAs shall develop guidelines on combined ICT business continuity policy and response and recovery plans for ICT-related incidents.",
      "obligations": [
        "Establish comprehensive ICT business continuity policy",
        "Ensure continuity of critical or important functions",
        "Respond to and resolve ICT-related incidents to limit damage",
        "Activate dedicated containment plans without delay",
        "Estimate preliminary impacts, damages and losses",
        "Ensure communication of updated information to all relevant internal staff",
        "Implement associated ICT response and recovery plans",
        "Maintain and periodically test ICT business continuity plans",
        "Conduct business impact analysis with quantitative and qualitative criteria including scenario analyses",
        "Test digital operational resilience plans at least once a year",
        "Test plans upon substantive ICT system changes",
        "Establish crisis management function with communication procedures",
        "Keep readily accessible records of activities before and during disruptions"
      ]
    },
    {
      "regulation": "DORA",
      "article": "Article 12",
      "title": "Backup Policies and Procedures, Restoration and Recovery Procedures and Methods",
      "domain": "ICT Risk Management",
      "text": "1. For the purposes of ensuring the restoration of ICT systems and data with minimum downtime, limited disruption and loss, as part of their ICT risk management framework, financial entities shall develop and document:\n\n(a) backup policies and procedures specifying the scope of the data that is subject to the backup and the minimum frequency of the backup, based on the criticality of information or the degree of confidentiality of the data;\n(b) restoration and recovery procedures and methods.\n\n2. Financial entities shall set up backup systems that can be activated in accordance with the backup policies and procedures and the restoration and recovery procedures and methods. The activation of backup systems shall not endanger the security of the network and information systems or the availability, authenticity, integrity or confidentiality of data. Testing of the backup procedures and restoration and recovery procedures and methods shall be undertaken periodically.\n\n3. When restoring backup data using own systems, financial entities shall use ICT systems that are physically and logically segregated from the source ICT system. The ICT systems must be securely protected from any unauthorized access or ICT corruption and allow for the timely restoration of services making use of data and system backups as necessary.\n\n4. Financial entities shall have in place appropriate multi-site resource configurations with sufficient capacity and capability to ensure business requirements. In the event of the unavailability of the primary ICT infrastructure, alternative ICT facilities, including at secondary sites, shall provide services with a level of service consistent with the financial entity's recovery time objectives and recovery point objectives.\n\n5. Financial entities shall establish recovery time objectives and recovery point objectives for each business function and determine the level of resources and the total recovery time allocated to each business function, taking into account business impact analyses and the financial entity's overall risk tolerance and risk appetite.\n\n6. Financial entities, other than microenterprises, shall report to the relevant competent authorities, upon their request, an estimation of aggregate annual costs and losses caused by major ICT-related incidents.",
      "obligations": [
        "Develop and document backup policies specifying scope and minimum frequency of backups",
        "Document restoration and recovery procedures and methods",
        "Set up backup systems that can be activated without endangering security",
        "Periodically test backup procedures and restoration and recovery procedures",
        "Use ICT systems physically and logically segregated from source for backup restoration",
        "Protect restoration ICT systems from unauthorized access and ICT corruption",
        "Establish multi-site resource configurations with sufficient capacity",
        "Ensure alternative ICT facilities provide consistent service levels at secondary sites",
        "Establish recovery time objectives (RTOs) and recovery point objectives (RPOs) for each business function",
        "Determine resources and total recovery time allocation by business function based on business impact analysis",
        "Report aggregate annual costs and losses from major ICT incidents to competent authorities upon request"
      ]
    },
    {
      "regulation": "DORA",
      "article": "Article 13",
      "title": "Learning and Evolving",
      "domain": "ICT Risk Management",
      "text": "1. Financial entities shall have in place capabilities and staff to gather information on vulnerabilities and cyber threats, ICT-related incidents, in particular cyber-attacks, and analyse the impact they are likely to have on their digital operational resilience.\n\n2. Financial entities shall put in place post-ICT-related incident reviews after a major ICT-related incident disrupts their core activities. Those reviews shall analyse the causes of disruption and identify required improvements to the ICT operations or within the ICT business continuity policy referred to in Article 11.\n\n3. Financial entities, other than microenterprises, shall monitor effective implementation of the improvement measures referred to in paragraph 2 and shall also monitor, on an ongoing basis, the technological developments relevant to their business activities and operations.\n\n4. Financial entities shall set up ICT security awareness programmes and digital operational resilience training as part of the staff training schemes. Those programmes and training shall be applicable to all staff and to senior management and shall have a level of complexity commensurate to the remit of their functions.\n\n5. Financial entities, other than microenterprises, shall monitor relevant ICT third-party dependencies, keep track of evolving threats to their arrangements with ICT third-party service providers and review regularly their exposure to operational risk related to ICT third-party service providers.\n\n6. Financial entities, other than microenterprises, shall report to the relevant competent authorities, on request, information about the number of major ICT-related incidents reported by ICT third-party service providers as part of the contractual arrangements.",
      "obligations": [
        "Establish capabilities and staff to gather information on vulnerabilities and cyber threats",
        "Analyse likely impact of ICT-related incidents on digital operational resilience",
        "Conduct post-ICT-related incident reviews after major incidents disrupting core activities",
        "Analyse causes of disruption and identify required operational improvements",
        "Monitor effective implementation of improvement measures",
        "Monitor technological developments relevant to business activities",
        "Set up ICT security awareness programmes for all staff and senior management",
        "Establish digital operational resilience training as part of staff training schemes",
        "Monitor relevant ICT third-party dependencies",
        "Track evolving threats in ICT third-party arrangements",
        "Review exposure to operational risk from ICT third-party service providers regularly"
      ]
    },
    {
      "regulation": "DORA",
      "article": "Article 14",
      "title": "Communication",
      "domain": "ICT Risk Management",
      "text": "1. As part of the ICT risk management framework referred to in Article 6(1), financial entities shall have in place crisis communication plans enabling a responsible disclosure of, at least, major ICT-related incidents or significant cyber threats to clients and counterparts as well as to the public, as appropriate.\n\n2. As part of the ICT risk management framework, financial entities shall implement communication policies for internal staff and for external stakeholders. Communication policies for staff shall address the need to make aware all relevant staff, including the management body, of at least all major ICT-related incidents, cyber threats and countermeasures adopted, as well as of the ICT risk management framework requirements.\n\n3. At least one person shall be tasked with implementing the communication strategy for ICT-related incidents and fulfilling the public and media relation function for that purpose.\n\n4. The communication obligations set out in this Article shall not result in the disclosure of confidential information or classified information or in the contravention of any applicable law.",
      "obligations": [
        "Establish crisis communication plans for major ICT-related incidents and significant cyber threats",
        "Enable responsible disclosure to clients, counterparts and the public as appropriate",
        "Implement communication policies for internal staff and external stakeholders",
        "Make all relevant staff aware of major ICT incidents, threats and countermeasures",
        "Make management body aware of ICT risk management framework requirements",
        "Designate at least one person responsible for ICT incident communication strategy",
        "Designate public and media relations function for ICT incidents",
        "Ensure communications do not disclose confidential or classified information"
      ]
    },
    {
      "regulation": "DORA",
      "article": "Article 15",
      "title": "Further Harmonisation of ICT Risk Management Tools, Methods, Processes and Policies",
      "domain": "ICT Risk Management",
      "text": "The ESAs shall, through the Joint Committee, in consultation with the European Union Agency for Cybersecurity (ENISA), develop common regulatory technical standards in order to:\n\n(a) specify further elements to be included in the ICT security policy, procedures, protocols and tools referred to in Article 9(2), with a view to ensuring the security of networks, enable adequate safeguards against intrusions and data misuse, preserve the availability, authenticity, integrity and confidentiality of data;\n\n(b) develop further components of the controls of access management rights referred to in Article 9(4), point (c), and associated human resources policy specifying access rights, procedures for granting and revoking rights, monitoring of anomalous behaviour;\n\n(c) develop further the mechanisms for the detection of anomalous activities referred to in Article 10(1) and criteria to trigger and initiate ICT-related incident response processes;\n\n(d) specify further tests referred to in Article 25, including their scope, testing methodologies, outcomes and remediation activities;\n\n(e) specify further any element of the ICT business continuity policy referred to in Article 11;\n\n(f) specify further the rules on the backup systems and restoration procedures referred to in Article 12;\n\n(g) specify further the elements of the post-incident reviews referred to in Article 13(2);\n\n(h) specify further the elements and format of reporting under Article 19.\n\nFinancial entities shall comply with applicable regulatory technical standards developed under this Article upon their publication in the Official Journal.",
      "obligations": [
        "Comply with regulatory technical standards developed by ESAs for ICT security policies",
        "Comply with RTS specifications for access management controls",
        "Comply with RTS specifications for anomalous activity detection mechanisms",
        "Comply with RTS specifications for testing scope and methodologies",
        "Comply with RTS specifications for ICT business continuity policy elements",
        "Comply with RTS specifications for backup systems and restoration procedures",
        "Comply with RTS specifications for post-incident reviews",
        "Comply with RTS specifications for incident reporting format and content"
      ]
    },
    {
      "regulation": "DORA",
      "article": "Article 16",
      "title": "Simplified ICT Risk Management Framework",
      "domain": "ICT Risk Management",
      "text": "1. Articles 5 to 15 shall not apply to microenterprises.\n\n2. Microenterprises shall apply a simplified ICT risk management framework comprising:\n\n(a) a summary of the policies and procedures addressing digital operational resilience, as required under Article 6(1);\n(b) at least a policy on ICT risk tolerance;\n(c) ICT business continuity plans that address continuity of critical or important functions, including backup systems;\n(d) guidelines on ICT incidents categorisation;\n(e) monitoring mechanisms;\n(f) policies on ICT-related security documentation;\n(g) policies on change and patch management;\n(h) assessment of ICT third-party risk;\n(i) ICT security training and awareness programme;\n(j) internal audits on ICT risk.\n\n3. Microenterprises shall also fulfil the requirements set out in Articles 17, 18, 19, 24, 25, 28, 29 and 30.\n\n4. In the event of changes in their size or risk profile that would bring them beyond the definition of a microenterprise, the entity shall review its ICT risk management framework and update it accordingly within a reasonable timeframe.",
      "obligations": [
        "Microenterprises apply simplified ICT risk management framework",
        "Establish summary of digital operational resilience policies and procedures",
        "Establish ICT risk tolerance policy",
        "Develop ICT business continuity plans including backup systems",
        "Establish guidelines for ICT incident categorisation",
        "Establish monitoring mechanisms",
        "Maintain ICT security documentation policies",
        "Maintain change and patch management policies",
        "Assess ICT third-party risk",
        "Establish ICT security training and awareness programme",
        "Conduct internal ICT risk audits",
        "Microenterprises must still comply with incident reporting, testing and third-party risk requirements",
        "Update ICT risk management framework when entity grows beyond microenterprise threshold"
      ]
    },
    {
      "regulation": "DORA",
      "article": "Article 17",
      "title": "ICT-related Incident Management Process",
      "domain": "Incident Reporting",
      "text": "1. Financial entities shall define, establish and implement an ICT-related incident management process to detect, manage and notify ICT-related incidents.\n\n2. Entities must document all ICT incidents and cyber threats, establishing procedures for integrated monitoring, handling, and follow-up to identify root causes and prevent recurrence.\n\n3. The management process requires:\n\n(a) put in place early warning indicators;\n(b) procedures to identify, track, log, categorise and classify incidents by priority, severity, and service criticality per Article 18(1);\n(c) assign roles and responsibilities that need to be activated for different ICT-related incident types and scenarios;\n(d) communication plans for staff, stakeholders, media pursuant to Article 14, client notification, escalation procedures, and information sharing with counterparty entities;\n(e) reporting major incidents to senior management and the management body, detailing impact, response, and additional controls;\n(f) establish ICT-related incident response procedures to mitigate impacts and ensure that services become operational and secure in a timely manner.",
      "obligations": [
        "Define, establish and implement an ICT-related incident management process",
        "Detect, manage and notify ICT-related incidents",
        "Document all ICT incidents and cyber threats",
        "Establish procedures for integrated monitoring, handling and follow-up",
        "Identify root causes and prevent recurrence of incidents",
        "Put in place early warning indicators",
        "Identify, track, log, categorise and classify incidents by priority, severity and service criticality",
        "Assign roles and responsibilities for different incident types and scenarios",
        "Establish communication plans for staff, stakeholders, media and clients",
        "Establish escalation procedures and information sharing with counterparty entities",
        "Report major incidents to senior management and management body",
        "Establish incident response procedures to mitigate impacts and ensure timely service restoration"
      ]
    },
    {
      "regulation": "DORA",
      "article": "Article 18",
      "title": "Classification of ICT-related Incidents and Cyber Threats",
      "domain": "Incident Reporting",
      "text": "1. Financial entities shall classify ICT-related incidents and shall determine their impact based on the following criteria: the number of clients or financial counterparts affected and, where applicable, the amount or number of transactions affected by the major ICT-related incident; the duration of the major ICT-related incident, including the service downtime; the geographical spread with regard to the areas affected by the major ICT-related incident, particularly if it affects more than two Member States; the data losses that the major ICT-related incident entails, in relation to availability, authenticity, integrity or confidentiality of data; the criticality of the services affected, including the financial entity's transactions and operations; the economic impact, in particular direct and indirect costs and losses, of the major ICT-related incident, in both absolute and relative terms.\n\n2. Entities shall classify cyber threats as significant based on the criticality of the services at risk, including the financial entity's transactions and operations, number and/or relevance of clients or financial counterparts targeted and the geographical spread of the areas at risk.\n\n3. The ESAs shall develop regulatory technical standards specifying materiality thresholds and criteria for classification. The ESAs must submit these standards to the Commission by January 17, 2024.",
      "obligations": [
        "Classify ICT-related incidents based on defined impact criteria",
        "Assess number of clients or counterparts affected",
        "Assess amount or number of transactions affected",
        "Assess duration of incident including service downtime",
        "Assess geographical spread of incident across Member States",
        "Assess data losses in relation to availability, authenticity, integrity and confidentiality",
        "Assess criticality of affected services including transactions and operations",
        "Assess economic impact in both absolute and relative terms",
        "Classify cyber threats as significant based on service criticality at risk",
        "Consider number and relevance of clients or counterparts targeted",
        "Consider geographical spread in cyber threat classification"
      ]
    },
    {
      "regulation": "DORA",
      "article": "Article 19",
      "title": "Reporting of major ICT-related incidents and voluntary notification of significant cyber threats",
      "domain": "Incident Reporting",
      "text": "1. Financial entities shall report major ICT-related incidents to the relevant competent authority as referred to in Article 46 in accordance with paragraph 4 of this Article. Where a financial entity is subject to supervision by more than one national competent authority, Member States shall designate a single competent authority as the relevant competent authority. Credit institutions classified as significant shall report to the relevant national competent authority, which shall immediately transmit the report to the ECB.\n\n2. Financial entities may, on a voluntary basis, notify significant cyber threats to the relevant competent authority when they deem the threat to be of relevance to the financial system, service users or clients.\n\n3. Where a major ICT-related incident occurs and has an impact on the financial interests of clients, financial entities shall, without undue delay as soon as they become aware of it, inform their clients about the major ICT-related incident and about the measures that have been taken to mitigate the adverse effects of such incident. In the case of a significant cyber threat, financial entities shall, where applicable, inform their clients that are potentially affected of any appropriate protection measures which the latter may consider taking.\n\n4. Financial entities shall submit the following to the relevant competent authority:\n(a) an initial notification;\n(b) an intermediate report after the initial notification, as soon as the status of the original incident has changed significantly, followed by updated notifications every time a relevant status update is available;\n(c) a final report, when the root cause analysis has been completed and the actual impact figures are available to replace estimates.\n\n5. Financial entities may outsource the reporting obligations under this Article to a third-party service provider. In case of such outsourcing, the financial entity remains fully responsible for the fulfilment of the incident reporting requirements.",
      "obligations": [
        "Report major ICT-related incidents to relevant competent authority",
        "Significant credit institutions report to ECB via national competent authority",
        "Voluntarily notify significant cyber threats to competent authority when relevant",
        "Inform clients without undue delay of major incidents impacting their financial interests",
        "Inform clients of measures taken to mitigate adverse effects",
        "Inform potentially affected clients of protection measures for significant cyber threats",
        "Submit initial notification to competent authority within specified time limits",
        "Submit intermediate reports when incident status changes significantly",
        "Provide updated notifications with each relevant status update",
        "Submit final report after root cause analysis completion with actual impact figures",
        "Remain fully responsible for reporting obligations even when outsourced"
      ]
    },
    {
      "regulation": "DORA",
      "article": "Article 20",
      "title": "Harmonisation of Reporting Content and Templates",
      "domain": "Incident Reporting",
      "text": "The ESAs shall, through the Joint Committee and in consultation with ENISA and the ECB, develop:\n\n(a) common regulatory technical standards in order to:\n(i) determine the content of reports for major ICT-related incidents pursuant to Article 19(1) and (4), based on the criteria set out in Article 18 and taking into account international cyber security standards and technical specifications;\n(ii) determine the timeframe and the content of the notification to clients pursuant to Article 19(3);\n(iii) determine the criteria applicable to financial entities for outsourcing the reporting obligation pursuant to Article 19(5);\n\n(b) common implementing technical standards to establish the standard forms, templates and procedures for financial entities to report a major ICT-related incident.\n\nFinancial entities shall use the common templates, forms and procedures established in the implementing technical standards when making reports under Article 19.\n\nThe ESAs shall submit those draft regulatory technical standards and draft implementing technical standards to the Commission by 17 July 2024.",
      "obligations": [
        "Use common reporting templates and forms prescribed by ESA technical standards for major ICT incident reports",
        "Follow standardised procedures for incident reporting to competent authorities",
        "Apply prescribed timeframes for client notifications as specified in technical standards",
        "Comply with ESA criteria when outsourcing reporting obligations",
        "Ensure report content meets regulatory technical standard requirements including international cybersecurity standards"
      ]
    },
    {
      "regulation": "DORA",
      "article": "Article 21",
      "title": "Centralised Reporting",
      "domain": "Incident Reporting",
      "text": "1. The ESAs shall, through the Joint Committee, prepare a joint report assessing the feasibility of further centralisation of incident reporting through a single EU Hub for major ICT-related incident reporting by financial entities. The joint report shall explore ways to facilitate the flow of major ICT-related incident reports, reduce duplication of reporting requirements, and examine the synergies with the NIS 2 Directive reporting framework.\n\n2. On the basis of that joint report, the Commission shall submit a report to the European Parliament and the Council, accompanied, where appropriate, by a legislative proposal.\n\n3. Where such a legislative proposal is adopted, all financial entities shall submit major ICT-related incident reports to a designated single EU Hub. The single EU Hub shall relay the reports to the relevant national competent authorities, to ENISA, to Europol's European Cybercrime Centre and to any other entity depending on the competences of the authority that has received the report.\n\nFinancial entities should monitor and be prepared to adapt their incident reporting processes if a centralised EU Hub is established, as the single point of entry would replace direct reporting to national competent authorities for major ICT incidents.",
      "obligations": [
        "Monitor regulatory developments regarding centralised EU incident reporting hub",
        "Be prepared to adapt incident reporting processes if single EU Hub is established",
        "Ensure incident reporting systems can accommodate potential future centralised reporting requirements",
        "Comply with any legislative changes establishing centralised reporting obligations"
      ]
    },
    {
      "regulation": "DORA",
      "article": "Article 22",
      "title": "Supervisory Feedback",
      "domain": "Incident Reporting",
      "text": "1. Without prejudice to the technical input, guidance or remedies and subsequent assistance that ENISA may provide in accordance with Directive (EU) 2022/2555, upon request of the financial entity the relevant competent authority shall, after receipt of the complete initial notification and of any subsequent report as referred to in Article 19(4), provide in a timely manner appropriate feedback or guidance to the financial entity, in particular regarding any remedies available at national level, confidential technical feedback, an overview of the cyber threats relevant to the financial entity and its sector, and guidance on the further conduct of incident response.\n\n2. Financial entities should, where appropriate, following the receipt of supervisory feedback:\n(a) update the relevant competent authority with their progress on the measures being taken;\n(b) take into account the guidance when investigating the incident;\n(c) integrate the guidance into their future incident response procedures.",
      "obligations": [
        "Request supervisory feedback from competent authority following major ICT incident reports where appropriate",
        "Update competent authority with progress on remedial measures following supervisory feedback",
        "Take into account competent authority guidance when investigating the incident",
        "Integrate supervisory guidance into future incident response procedures",
        "Engage with ENISA technical input and guidance as available"
      ]
    },
    {
      "regulation": "DORA",
      "article": "Article 23",
      "title": "Operational or Security Payment-related Incidents",
      "domain": "Incident Reporting",
      "text": "1. The requirements on major ICT-related incident reporting set out in Articles 19 and 20 shall also apply to major operational or security payment-related incidents where a financial entity, other than those referred to in point (c) of Article 2(1), is subject to the requirements of Directive (EU) 2015/2366.\n\n2. Competent authorities shall inform EBA of payment incident reports received under Directive (EU) 2015/2366 and forward those reports to EBA on a timely basis, unless such reports would not be considered major under Article 19.\n\n3. To the extent that the content of payment incident reports fulfils the requirements of the reporting obligations under this Article, financial entities may satisfy the requirements of this Article by submitting their payment incident reports. Duplication of reporting is not required where major operational or security payment-related incidents meet the criteria of major ICT-related incidents.\n\n4. Financial entities subject to payment services regulations must align their operational or security incident reporting with DORA requirements to avoid duplicative reporting obligations. A single report satisfying both DORA and payment services directive requirements is acceptable where criteria are met.",
      "obligations": [
        "Apply major ICT incident reporting requirements to major operational or security payment-related incidents",
        "Report major operational or security payment incidents to relevant competent authorities",
        "Align payment incident reporting with DORA incident reporting requirements",
        "Avoid duplicative reporting where a single report satisfies both DORA and payment services requirements",
        "Ensure payment-related incident reports meet DORA content and format requirements"
      ]
    },
    {
      "regulation": "DORA",
      "article": "Article 24",
      "title": "Digital Operational Resilience Testing",
      "domain": "Resilience Testing",
      "text": "1. Financial entities, excluding microenterprises, shall maintain a sound and comprehensive digital operational resilience testing programme integrated into their ICT risk-management framework.\n\n2. The testing programme shall encompass a range of assessments, tests, methodologies, practices and tools as set out in Articles 25 and 26.\n\n3. The programme shall apply a risk-based approach considering the evolving landscape of ICT risk and any specific exposures of the financial entity.\n\n4. Tests shall be undertaken by independent parties, whether internal or external. Where internal testers conduct tests, financial entities shall dedicate sufficient resources and ensure that conflicts of interest are avoided throughout the design and execution phases of the test.\n\n5. Financial entities shall establish procedures and policies to prioritise, classify and remedy all issues revealed through the performance of the tests and shall establish internal validation methodologies to ascertain that all identified weaknesses, deficiencies or gaps are fully addressed.\n\n6. Financial entities shall ensure that at least yearly, appropriate tests are conducted on all ICT systems and applications supporting critical or important functions.",
      "obligations": [
        "Maintain sound and comprehensive digital operational resilience testing programme",
        "Integrate testing programme into ICT risk-management framework",
        "Apply risk-based approach considering evolving ICT risk landscape",
        "Ensure tests undertaken by independent parties (internal or external)",
        "Ensure internal testers have dedicated resources and no conflicts of interest",
        "Establish procedures to prioritise, classify and remedy issues revealed through testing",
        "Establish internal validation methodologies to confirm weaknesses are fully addressed",
        "Conduct appropriate tests yearly on all ICT systems supporting critical or important functions"
      ]
    },
    {
      "regulation": "DORA",
      "article": "Article 25",
      "title": "Testing of ICT Tools and Systems",
      "domain": "Resilience Testing",
      "text": "1. The digital operational resilience testing programme referred to in Article 24 shall provide for the execution of appropriate tests, such as vulnerability assessments and scans, open source analyses, network security assessments, gap analyses, physical security reviews, questionnaires and scanning software solutions, source code reviews where feasible, scenario-based tests, compatibility testing, performance testing, end-to-end testing and penetration testing.\n\n2. Central securities depositories and central counterparties shall perform vulnerability assessments before any deployment or redeployment of new or existing applications and infrastructure components, and ICT services supporting critical or important functions of the financial entity.\n\n3. Microenterprises shall perform the tests referred to in paragraph 1 by combining a risk-based approach with a strategic planning of ICT testing, by duly considering the need to maintain a balanced approach between the scale of resources and the time to be allocated to the ICT testing, on the one hand, and the urgency, type of risk, criticality of information assets and of services provided, as well as any other relevant factor, on the other hand.",
      "obligations": [
        "Execute vulnerability assessments and scans",
        "Conduct open source analyses",
        "Perform network security assessments",
        "Conduct gap analyses",
        "Perform physical security reviews",
        "Use questionnaires and scanning software solutions",
        "Conduct source code reviews where feasible",
        "Perform scenario-based tests",
        "Conduct compatibility testing",
        "Perform performance testing",
        "Conduct end-to-end testing",
        "Perform penetration testing",
        "Perform vulnerability assessments before deployment of new applications and infrastructure"
      ]
    },
    {
      "regulation": "DORA",
      "article": "Article 26",
      "title": "Advanced Testing of ICT Tools, Systems and Processes Based on Threat-Led Penetration Testing",
      "domain": "Resilience Testing",
      "text": "1. Financial entities, other than microenterprises, that are identified by competent authorities as required to perform threat-led penetration testing (TLPT) shall carry out such testing at least every 3 years. Based on the risk profile of the financial entity and taking into account operational circumstances, the competent authority may where necessary request the financial entity to reduce or increase this frequency.\n\n2. Each threat-led penetration test shall cover several or all critical or important functions of a financial entity and shall be performed on live production systems supporting such functions.\n\n3. Financial entities shall identify all relevant underlying ICT systems, processes and technologies supporting critical or important functions and ICT services, including those outsourced or contracted to ICT third-party service providers, and, taking into account the fact that the financial entity remains fully responsible for ensuring compliance with this Article, shall coordinate with ICT third-party service providers to ensure their participation.\n\n4. Threat-led penetration testing shall cover at minimum the following network perimeters: data flows in and out of network perimeters; network segmentation; and the security of third party services.\n\n5. Financial entities shall use the threat intelligence to:\n(a) determine the threat actors and their specific attack scenarios;\n(b) define the scope of the TLPT;\n(c) test against realistic and credible attack scenarios.\n\n6. Pooled testing may be performed by multiple financial entities where an ICT third-party service provider provides material ICT services to multiple financial entities, subject to regulatory agreement and coordination by the lead overseer.\n\n7. Upon completion of the TLPT, the financial entity and any ICT third-party service provider involved shall address all identified risks and remediate vulnerabilities discovered through the TLPT. The financial entity shall share the findings of the TLPT with the relevant competent authority.\n\n8. Financial entities shall ensure the ICT third-party service providers' participation in TLPT activities in the contractual arrangements with those providers.",
      "obligations": [
        "Conduct threat-led penetration testing (TLPT) at least every 3 years when required by competent authority",
        "Cover several or all critical or important functions in each TLPT",
        "Perform TLPT on live production systems",
        "Identify all relevant ICT systems, processes and technologies supporting critical or important functions",
        "Coordinate with ICT third-party service providers to ensure their participation in TLPT",
        "Cover minimum network perimeters: data flows, network segmentation, third-party service security",
        "Use threat intelligence to determine threat actors, attack scenarios and TLPT scope",
        "Test against realistic and credible attack scenarios",
        "Address all identified risks and remediate vulnerabilities after TLPT completion",
        "Share TLPT findings with relevant competent authority",
        "Ensure ICT third-party provider TLPT participation in contractual arrangements"
      ]
    },
    {
      "regulation": "DORA",
      "article": "Article 27",
      "title": "Requirements for Testers for the Carrying out of Threat-Led Penetration Testing",
      "domain": "Resilience Testing",
      "text": "1. Financial entities shall only use testers for the carrying out of TLPT that:\n\n(a) are of the highest suitability and repute;\n(b) possess technical and organisational capabilities and demonstrate specific expertise in threat intelligence, penetration testing and red team operations;\n(c) are certified by an accreditation body in a Member State or adhere to formal codes of conduct or ethical frameworks;\n(d) provide an independent assurance, or are audited, in relation to the sound management of risks associated with the carrying out of TLPT;\n(e) are duly covered by relevant professional indemnity insurances, including against risks of misconduct and negligence.\n\n2. When using internal testers, financial entities shall ensure that:\n(a) such use has been approved by the relevant competent authority;\n(b) the relevant competent authority has verified that the financial entity has sufficient dedicated resources and ensured that conflicts of interest are avoided throughout the design and execution phases of the test;\n(c) the threat intelligence provider is external to the financial entity.\n\n3. Financial entities shall ensure that testers contracted to conduct TLPT comply, throughout the duration of the TLPT, with the requirements set out in paragraph 1. Financial entities shall perform appropriate due diligence when selecting testers.\n\n4. TLPT carried out in accordance with this Article and with the TIBER-EU framework as implemented in national law or as applied by the competent authorities shall be mutually recognised across Member States.",
      "obligations": [
        "Use only testers of highest suitability and repute for TLPT",
        "Ensure testers possess technical capabilities in threat intelligence, penetration testing and red team operations",
        "Use certified or formally accredited testers adhering to recognised codes of conduct",
        "Ensure testers provide independent assurance on sound management of TLPT risks",
        "Ensure testers are covered by relevant professional indemnity insurance",
        "Obtain competent authority approval when using internal testers for TLPT",
        "Verify internal testers have dedicated resources and no conflicts of interest",
        "Ensure threat intelligence provider is external when using internal testers",
        "Verify tester compliance with requirements throughout TLPT duration",
        "Perform appropriate due diligence when selecting TLPT testers"
      ]
    },
    {
      "regulation": "DORA",
      "article": "Article 28",
      "title": "General Principles — ICT Third-Party Risk Management",
      "domain": "Third-Party Risk",
      "text": "1. Financial entities shall manage ICT third-party risk as an integral component of ICT risk within their ICT risk management framework, in accordance with the following principles:\n\n(a) financial entities that have in place contractual arrangements for the use of ICT services to run their business operations shall, at all times, remain fully responsible for compliance with, and the discharge of, all obligations under this Regulation and applicable financial services law;\n(b) financial entities' management of ICT third-party risk shall be implemented in light of the principle of proportionality, taking into account:\n(i) the nature, scale, complexity and importance of ICT-related dependencies;\n(ii) the risks arising from contractual arrangements on the use of ICT services.\n\n2. Entities shall adopt and regularly review a strategy on ICT third-party risk including policies on use of ICT services supporting critical or important functions, applied individually and on sub-consolidated and consolidated bases.\n\n3. Financial entities shall maintain and update at entity level, and at sub-consolidated and consolidated levels, a register of information in relation to all contractual arrangements on the use of ICT services provided by ICT third-party service providers. The register shall be reported yearly to competent authorities.\n\n4. Before entering into a contractual arrangement on the use of ICT services, financial entities shall:\n(a) assess whether the contractual arrangement covers the use of ICT services supporting a critical or important function;\n(b) assess whether supervisory conditions for contracting are met;\n(c) identify and assess all relevant risks in relation to the contractual arrangement, including concentration risk;\n(d) undertake all due diligence on prospective ICT third-party service providers;\n(e) identify and assess conflicts of interest that the contractual arrangement may cause.\n\n5. ICT third-party service providers shall comply with appropriate information security standards. Where contractual arrangements concern critical or important functions, financial entities shall, before concluding the arrangements, duly consider the use of the most up-to-date and highest quality information security standards.\n\n6. In exercising access and audit rights on ICT third-party service providers, financial entities shall determine the frequency of audits and inspections based on a risk-based approach and commonly accepted audit standards.\n\n7. Financial entities shall have the right to terminate contractual arrangements where:\n(a) significant breach of applicable laws, regulations or contractual terms;\n(b) circumstances altering the performance of the functions under the contractual arrangement;\n(c) evidence of weaknesses in the ICT third-party service provider's overall ICT risk management;\n(d) circumstances where the competent authority can no longer effectively supervise the financial entity.\n\n8. For critical or important functions, financial entities shall put in place exit strategies for orderly termination of the contractual arrangement.",
      "obligations": [
        "Manage ICT third-party risk within ICT risk management framework",
        "Remain fully responsible for compliance with DORA despite third-party arrangements",
        "Implement third-party risk management with proportionality principle",
        "Adopt and regularly review ICT third-party risk strategy",
        "Establish policy on ICT services supporting critical or important functions",
        "Maintain register of all contractual arrangements at entity, sub-consolidated and consolidated levels",
        "Report register yearly to competent authorities",
        "Assess whether services support critical or important function before contracting",
        "Verify supervisory conditions are met before contracting",
        "Identify and assess all relevant risks including concentration risk",
        "Conduct due diligence on prospective ICT third-party providers",
        "Identify and assess conflicts of interest",
        "Require ICT third-party providers to comply with appropriate information security standards",
        "Consider most up-to-date information security standards for critical/important function providers",
        "Determine audit frequency based on risk-based approach",
        "Use commonly accepted audit standards for third-party assessments",
        "Establish termination rights for significant breaches",
        "Establish termination rights for performance-altering circumstances",
        "Establish termination rights for ICT risk weaknesses",
        "Establish termination rights for supervisory impediments",
        "Develop exit strategies for orderly termination for critical or important functions"
      ]
    },
    {
      "regulation": "DORA",
      "article": "Article 29",
      "title": "Preliminary Assessment of ICT Concentration Risk",
      "domain": "Third-Party Risk",
      "text": "1. When performing the identification and assessment of risks referred to in Article 28(4)(c), financial entities shall also determine whether the conclusion of a contractual arrangement for ICT services supporting critical or important functions would lead to:\n\n(a) contracting an ICT third-party service provider that is not easily substitutable;\n(b) having in place multiple contractual arrangements in relation to the provision of ICT services supporting critical or important functions with the same ICT third-party service provider or with closely connected ICT third-party service providers.\n\nFinancial entities shall weigh the benefits and costs of alternative solutions, such as the use of different ICT third-party service providers, taking into account whether and how envisaged solutions match the business needs and objectives set out in the digital operational resilience strategy.\n\n2. Where the contractual arrangements on the use of ICT services include the possibility that an ICT third-party service provider further subcontracts ICT services supporting a critical or important function to other ICT third-party service providers, financial entities shall weigh benefits and risks that may arise in connection with such subcontracting, in particular with regard to a third-country ICT subcontractor.\n\nWhere contractual arrangements concern ICT services supporting critical or important functions, financial entities shall duly consider the insolvency law provisions that would apply in the event of the ICT third-party service provider's bankruptcy as well as any constraint that may arise in respect of the urgent recovery of the financial entity's data.\n\nWhere contractual arrangements on the use of ICT services are concluded with an ICT third-party service provider established in a third country, financial entities shall additionally consider compliance with Union data protection rules and the effective enforcement of the law in that third country.\n\nWhere the subcontracting is permitted, financial entities shall evaluate whether and how potentially long or complex chains of subcontracting may impact their ability to fully monitor the contracted functions and the ability of the competent authority to effectively supervise the financial entity in that respect.",
      "obligations": [
        "Assess concentration risk before concluding critical or important function service arrangements",
        "Evaluate substitutability of proposed third-party provider",
        "Assess multiple-arrangement risk with same or closely connected providers",
        "Weigh benefits and costs of alternative solutions",
        "Align third-party arrangements with digital operational resilience strategy",
        "Assess risks of permitted subcontracting for critical or important functions",
        "Evaluate third-country subcontractor risks",
        "Consider insolvency law provisions applicable to the provider",
        "Assess constraints affecting urgent data recovery",
        "Assess third-country provider compliance with Union data protection rules",
        "Assess effective enforcement of law in third country",
        "Evaluate impact of complex subcontracting chains on monitoring ability"
      ]
    },
    {
      "regulation": "DORA",
      "article": "Article 30",
      "title": "Key Contractual Provisions",
      "domain": "Third-Party Risk",
      "text": "1. The rights and obligations of the financial entity and of the ICT third-party service provider shall be clearly allocated and set out in writing. The full contract shall include the service level agreement and be documented in one written document that is available to the parties on paper, or in a document with another downloadable, durable and accessible format.\n\n2. Contractual arrangements on the use of ICT services shall include at least the following elements:\n\n(a) a clear and complete description of all functions and ICT services to be provided by the ICT third-party service provider, indicating whether subcontracting of an ICT service supporting a critical or important function, or material parts thereof, is permitted, and, where it is, the conditions applicable to such subcontracting;\n(b) the locations, namely the regions or countries, where the contracted or subcontracted functions and ICT services are to be provided and where data is to be processed, including the storage location, and the requirement for the ICT third-party service provider to notify the financial entity if it envisages changing such locations;\n(c) provisions on availability, authenticity, integrity and confidentiality in relation to the protection of data, including personal data;\n(d) provisions on ensuring access to, recovery and return of, in an easily accessible format, personal and non-personal data processed by the ICT third-party service provider in the event of the insolvency, resolution or discontinuation of the business operations of that provider, or in the event of the termination of the contractual arrangements;\n(e) service level descriptions, including updates and revisions thereof;\n(f) the obligation of the ICT third-party service provider to provide assistance to the financial entity at no additional cost, or at a cost that is determined ex-ante, when an ICT incident that is related to the ICT service provided to the financial entity occurs;\n(g) the obligation of the ICT third-party service provider to fully cooperate with the competent authorities and the resolution authorities of the financial entity, including persons appointed by them;\n(h) termination rights and related minimum notice periods for the termination of the contractual arrangements, in accordance with the expectations of competent authorities and resolution authorities;\n(i) conditions for the participation of ICT third-party service providers in the financial entities' ICT security awareness programmes and digital operational resilience training.\n\n3. For contractual arrangements on the use of ICT services supporting critical or important functions, the following elements shall additionally be included:\n\n(a) full service level descriptions, including updates and revisions thereof, with precise quantitative and qualitative performance targets within the agreed service levels;\n(b) notice periods and reporting obligations of the ICT third-party service provider to the financial entity, including notification of any development that might have a material impact on the ICT third-party service provider's ability to effectively provide the ICT services;\n(c) requirements for the ICT third-party service provider to implement and test business contingency plans;\n(d) the obligation of the ICT third-party service provider to participate in and fully cooperate with the financial entity's TLPT as referred to in Articles 26 and 27;\n(e) the right to monitor, on an ongoing basis, the ICT third-party service provider's performance, which shall entail:\n(i) unrestricted rights of access, inspection and audit by the financial entity, or an appointed third party, and by the competent authority;\n(ii) the right to agree on alternative assurance levels if other clients' rights are affected;\n(f) exit strategies, in particular the establishment of a mandatory adequate transition period:\n(i) during which the ICT third-party service provider will continue providing the respective functions or ICT services with a view to reducing the risk of disruption at the financial entity or to allowing the financial entity to effectively transition to another third-party service provider or to in-house solutions;\n(ii) allowing the financial entity to migrate to another ICT third-party service provider or to in-house solutions.\n\n4. Financial entities and ICT third-party service providers shall use standard contractual clauses developed by public authorities for specific services.\n\n5. The ESAs shall develop draft regulatory technical standards on standard contractual clauses by 17 July 2024.",
      "obligations": [
        "Clearly allocate rights and obligations in writing",
        "Document full contract including SLA in writing or accessible durable format",
        "Provide clear and complete description of all functions and ICT services",
        "Specify subcontracting permissions and applicable conditions",
        "Specify locations of service provision and data processing",
        "Require notification when provider changes locations",
        "Include data availability, authenticity, integrity and confidentiality protection provisions",
        "Include provisions for data access, recovery and return upon insolvency or termination",
        "Include service level descriptions including updates and revisions",
        "Require provider assistance at no additional cost upon ICT incident",
        "Require full cooperation with competent authorities and resolution authorities",
        "Include termination rights and minimum notice periods",
        "Include conditions for participation in ICT security awareness programmes",
        "Include precise quantitative and qualitative performance targets for critical/important functions",
        "Include notice periods and reporting obligations for material impact developments",
        "Require provider to implement and test business contingency plans",
        "Require provider participation in TLPT per Articles 26 and 27",
        "Include unrestricted rights of access, inspection and audit",
        "Include exit strategies with mandatory adequate transition period",
        "Transition period must allow continued service provision to reduce disruption risk",
        "Transition period must allow migration to another provider or in-house solutions",
        "Use standard contractual clauses developed by public authorities where available"
      ]
    },
    {
      "regulation": "DORA",
      "article": "Article 31",
      "title": "Designation of Critical ICT Third-Party Service Providers",
      "domain": "ICT Third-Party Oversight",
      "text": "1. The ESAs, through the Joint Committee, on the basis of a recommendation from the Joint Examination Team, shall designate ICT third-party service providers that are critical for financial entities.\n\n2. The designation shall be based on criteria including: the systemic impact on the stability, continuity or quality of the provision of financial services of ICT third-party service providers' failure or disruption; the systemic character or importance of the financial entities that rely on the relevant ICT third-party service providers; the degree of substitutability of the ICT third-party service provider; the number of global systemically important institutions (G-SIIs) or other systemically important institutions (O-SIIs) that rely on the ICT third-party service provider; the interdependence between the ICT third-party service providers and the number of ICT third-party service providers that are interconnected with each other; and the innovation level or the degree of sophistication of the ICT services involved.\n\n3. A designation as a critical ICT third-party service provider shall not be made where the ICT third-party service provider is:\n(a) a financial entity under this Regulation;\n(b) a financial entity or an ICT third-party service provider established in a third country where reciprocal oversight of ICT third-party service providers does not exist;\n(c) an intra-group ICT service provider.\n\n4. The ESAs shall maintain a public register of designated critical ICT third-party service providers.\n\nFinancial entities must identify which of their ICT third-party service providers are or become designated as critical, as this affects oversight requirements and enhances the scrutiny applied to those providers.",
      "obligations": [
        "Identify which ICT third-party providers are designated as critical by ESAs",
        "Monitor the ESA public register of designated critical ICT third-party service providers",
        "Apply heightened oversight to contractual arrangements with critical ICT third-party service providers",
        "Understand that critical ICT third-party service providers are subject to Lead Overseer supervision",
        "Cooperate with Lead Overseer information requests regarding critical provider relationships",
        "Notify competent authorities of material changes to arrangements with critical ICT third-party providers"
      ]
    },
    {
      "regulation": "DORA",
      "article": "Article 32",
      "title": "Structure of the Oversight Framework",
      "domain": "ICT Third-Party Oversight",
      "text": "1. The Joint Committee of the ESAs, assisted by the Oversight Forum, shall coordinate the Oversight Framework activities of the relevant ESAs and ensure consistent application.\n\n2. Each critical ICT third-party service provider shall be assigned to one of the ESAs as a Lead Overseer based on which type of financial entities it primarily provides services to. The Lead Overseer for critical ICT third-party service providers primarily serving credit institutions and investment firms shall be the EBA. The Lead Overseer for critical ICT third-party service providers primarily serving insurance undertakings shall be EIOPA. The Lead Overseer for critical ICT third-party service providers primarily serving fund managers, CCPs, trading venues and trade repositories shall be ESMA.\n\n3. The Oversight Forum shall be composed of the Chairpersons of the ESAs, high-level representatives from competent authorities, and the ECB. It shall, inter alia, prepare draft recommendations for Lead Overseers and facilitate coordination of national competent authorities regarding oversight of critical ICT third-party service providers.\n\n4. Financial entities shall cooperate with the Lead Overseer and provide information requested by the Lead Overseer regarding their use of services from critical ICT third-party service providers.\n\n5. The Lead Overseer shall have access to all relevant documents and information including those held by financial entities related to critical ICT third-party providers.",
      "obligations": [
        "Cooperate with the Lead Overseer (EBA, EIOPA or ESMA depending on entity type) regarding critical ICT third-party providers",
        "Provide information requested by Lead Overseer on use of critical ICT third-party services",
        "Make documents and information available to Lead Overseer when requested",
        "Understand that EBA oversees critical providers serving credit institutions and investment firms",
        "Understand that EIOPA oversees critical providers serving insurance undertakings",
        "Understand that ESMA oversees critical providers serving fund managers, CCPs, trading venues and trade repositories"
      ]
    },
    {
      "regulation": "DORA",
      "article": "Article 33",
      "title": "Tasks of the Lead Overseer",
      "domain": "ICT Third-Party Oversight",
      "text": "1. The Lead Overseer shall carry out the following tasks:\n\n(a) be the primary point of contact for the critical ICT third-party service provider in relation to the exercise of the oversight mandate;\n(b) on the basis of a recommendation from the Oversight Forum, take measures;\n(c) draw up the individual oversight plan describing the annual supervisory objectives and the main oversight actions planned for each critical ICT third-party service provider;\n(d) jointly conduct, with the relevant competent authorities, all activities and tasks with respect to the performance of their oversight mandate.\n\n2. The Lead Overseer shall carry out, in relation to critical ICT third-party service providers subject to its oversight, the following tasks:\n\n(a) carry out general investigations and inspections;\n(b) request information and documentation from the critical ICT third-party service provider;\n(c) require the critical ICT third-party service provider to participate in general investigations and inspections;\n(d) impose non-financial penalties in accordance with Article 35(6);\n(e) issue recommendations to the critical ICT third-party service provider;\n(f) draw up the annual oversight report.\n\n3. Financial entities shall support the Lead Overseer in its supervision of critical ICT third-party service providers and ensure that their contractual arrangements with such providers allow the Lead Overseer to exercise its oversight mandate effectively.",
      "obligations": [
        "Support Lead Overseer tasks in supervising critical ICT third-party service providers",
        "Ensure contractual arrangements with critical ICT providers allow Lead Overseer effective oversight",
        "Include provisions in contracts enabling Lead Overseer access and inspection rights",
        "Cooperate with general investigations and inspections of critical ICT third-party providers",
        "Provide information to Lead Overseer as requested regarding critical ICT provider relationships"
      ]
    },
    {
      "regulation": "DORA",
      "article": "Article 34",
      "title": "Operational Coordination between Lead Overseers",
      "domain": "ICT Third-Party Oversight",
      "text": "1. Lead Overseers shall coordinate and cooperate, in particular through the Oversight Forum, when exercising their respective oversight mandates.\n\n2. Lead Overseers shall share information related to critical ICT third-party service providers, including information on serious incidents and on oversight assessments.\n\n3. National competent authorities shall cooperate with the Lead Overseer and share information with the Lead Overseer where such information is relevant to the oversight of the critical ICT third-party service providers.\n\n4. Financial entities shall not be required to disclose the same information to multiple Lead Overseers where a critical ICT third-party service provider is subject to oversight by more than one Lead Overseer.\n\nFinancial entities should be aware of the coordination mechanisms between oversight authorities to avoid duplication and ensure consistency in responding to information requests related to their critical ICT third-party service providers.",
      "obligations": [
        "Avoid duplicative information disclosures where critical provider is subject to multiple Lead Overseers",
        "Cooperate with coordinated oversight activities across multiple Lead Overseers",
        "Maintain records enabling coordinated oversight information requests to be fulfilled efficiently"
      ]
    },
    {
      "regulation": "DORA",
      "article": "Article 35",
      "title": "Powers of the Lead Overseer",
      "domain": "ICT Third-Party Oversight",
      "text": "1. For the purpose of fulfilling the mandate referred to in Article 33(2), the Lead Overseer shall have the following powers in relation to critical ICT third-party service providers:\n\n(a) the power to request all relevant information and documentation pursuant to Article 37;\n(b) the power to conduct general investigations and inspections pursuant to Articles 38 and 39;\n(c) the power to request, after the completion of the oversight activities, reports specifying the actions taken or the remedies implemented by the critical ICT third-party service provider in relation to the recommendations of the Lead Overseer.\n\n2. The Lead Overseer may also conduct oversight activities jointly with the competent authorities.\n\n3. When exercising its powers, the Lead Overseer shall take into account the scale and complexity of the services provided by the critical ICT third-party service provider, and the nature, extent and complexity of the ICT services provided to financial entities.\n\n4. The Lead Overseer shall impose periodic penalty payments to compel critical ICT third-party service providers to comply with requests for information, investigations, inspections, remediation actions and recommendations.\n\n5. The periodic penalty payment for each day of non-compliance shall not exceed 1% of the average daily worldwide turnover of the critical ICT third-party service provider in the preceding business year.\n\n6. The Lead Overseer may require, within a specified period, financial entities that use services from the critical ICT third-party service provider to terminate, in full or in part, the contractual arrangements with that provider.\n\nFinancial entities must cooperate with the Lead Overseer when exercising its powers and may be required to terminate arrangements with non-compliant critical ICT third-party service providers.",
      "obligations": [
        "Cooperate with Lead Overseer investigations and information requests regarding critical ICT providers",
        "Provide documentation requested by Lead Overseer about critical ICT provider relationships",
        "Be prepared to terminate contractual arrangements with critical ICT providers upon Lead Overseer order",
        "Cooperate with joint oversight activities conducted with competent authorities",
        "Facilitate Lead Overseer access to conduct oversight activities effectively"
      ]
    },
    {
      "regulation": "DORA",
      "article": "Article 36",
      "title": "Exercise of the Powers of the Lead Overseer Outside the Union",
      "domain": "ICT Third-Party Oversight",
      "text": "1. Where an ICT third-party service provider that has been designated as critical is established in a third country, it shall establish a subsidiary in the Union within 12 months of its designation as a critical ICT third-party service provider.\n\n2. The requirement referred to in paragraph 1 shall not apply where:\n(a) the ICT third-party service provider is established in a country with which the Union has concluded an international agreement on the mutual recognition and equivalence of oversight regimes for ICT third-party service providers;\n(b) the ICT third-party service provider can demonstrate that the oversight requirements applied in the third country in which it is established are equivalent to those of this Regulation;\n(c) after the completion of the oversight activities, the Lead Overseer has concluded that the ICT third-party service provider is not subject to oversight arrangements in a third country.\n\n3. Financial entities using services from third-country critical ICT third-party service providers shall monitor the status of Union subsidiary requirements and the compliance of their providers.\n\nFinancial entities contracting ICT services from providers in third countries should assess whether those providers may be designated as critical and what the implications are for their service arrangements and continuity.",
      "obligations": [
        "Monitor compliance of critical third-country ICT providers with Union subsidiary establishment requirements",
        "Assess implications of third-country provider designation as critical for service continuity",
        "Consider third-country regulatory equivalence when evaluating ICT provider risk",
        "Include provisions in contracts with third-country providers addressing oversight cooperation requirements",
        "Plan for contingency if third-country critical ICT provider fails to establish EU subsidiary"
      ]
    },
    {
      "regulation": "DORA",
      "article": "Article 37",
      "title": "Request for Information",
      "domain": "ICT Third-Party Oversight",
      "text": "1. The Lead Overseer may, by simple request or by decision, require critical ICT third-party service providers to provide all information that is necessary for the Lead Overseer to carry out its duties under this Regulation, including all relevant business or operational documents, contracts, policies, documentation, ICT security audit reports, ICT-related incident reports, as well as any information relating to parties to whom the critical ICT third-party service provider has outsourced operational functions or activities.\n\n2. When sending a simple request for information under paragraph 1, the Lead Overseer shall:\n(a) refer to this Article as the legal basis of the request;\n(b) state the purpose of the request;\n(c) specify what information is required;\n(d) set a time limit within which the information is to be provided;\n(e) indicate that there is no obligation to provide the information, but that a voluntary reply to the request must not be incorrect or misleading.\n\n3. Financial entities that use services from the critical ICT third-party service provider may be required to assist in providing information where the Lead Overseer determines this is necessary and where information is held at the level of the financial entity.\n\n4. Financial entities shall maintain comprehensive records of their contractual arrangements with critical ICT third-party service providers to facilitate responses to information requests from the Lead Overseer.",
      "obligations": [
        "Assist the Lead Overseer in providing information about critical ICT third-party provider relationships where requested",
        "Maintain comprehensive records of contractual arrangements with critical ICT third-party providers",
        "Respond promptly and accurately to Lead Overseer requests for information",
        "Ensure records include all relevant documents, contracts, policies and audit reports related to critical ICT providers",
        "Ensure information provided to Lead Overseer is accurate, complete and not misleading"
      ]
    },
    {
      "regulation": "DORA",
      "article": "Article 38",
      "title": "General Investigations",
      "domain": "ICT Third-Party Oversight",
      "text": "1. In order to carry out its duties under this Regulation, and with the assistance of the competent authorities of the Member States in which the critical ICT third-party service provider operates or in which the relevant premises are located, the Lead Overseer may conduct investigations of critical ICT third-party service providers.\n\n2. The Lead Overseer shall have the power to:\n(a) examine records, data, procedures, and any other material relevant to the execution of its tasks, irrespective of the medium on which they are stored;\n(b) take or obtain certified copies of or extracts from such records, data, procedures and other material;\n(c) summon and ask representatives of the critical ICT third-party service provider for oral or written explanations on facts or documents relating to the subject-matter and purpose of the inspection and to record the answers;\n(d) interview any other natural or legal person who consents to be interviewed for the purpose of collecting information relating to the subject-matter of an investigation.\n\n3. Financial entities may be interviewed or requested to provide supporting documentation or evidence during a Lead Overseer investigation of a critical ICT third-party service provider.\n\n4. Financial entities shall cooperate fully and promptly with Lead Overseer investigations and shall ensure that their contractual arrangements with critical ICT third-party service providers include provisions facilitating such cooperation.",
      "obligations": [
        "Cooperate fully with Lead Overseer investigations of critical ICT third-party providers",
        "Provide oral or written explanations to Lead Overseer investigators when requested",
        "Provide supporting documentation or evidence during Lead Overseer investigations",
        "Ensure contractual arrangements include provisions facilitating Lead Overseer investigation cooperation",
        "Make records and data available to Lead Overseer investigators upon request"
      ]
    },
    {
      "regulation": "DORA",
      "article": "Article 39",
      "title": "Inspections",
      "domain": "ICT Third-Party Oversight",
      "text": "1. In order to carry out its duties under this Regulation, the Lead Overseer may, with prior notification, conduct on-site inspections at any business premises, land or property of the critical ICT third-party service provider, as well as off-site inspections.\n\n2. The Lead Overseer shall have the power to:\n(a) enter any business premises, land or property;\n(b) examine the books, records and data in whatever form they are stored;\n(c) obtain or take copies of documents;\n(d) carry out audits of the ICT risk management, policies, procedures, ICT systems and processes of the critical ICT third-party service provider;\n(e) interview staff.\n\n3. Officials and other persons authorised by the Lead Overseer to conduct an on-site inspection shall exercise their powers upon production of a written authorisation.\n\n4. Officials authorised by the Lead Overseer may also seal any business premises and books and records for the period of, and to the extent necessary for, the inspection.\n\n5. Financial entities shall be notified of and may be required to participate in or facilitate Lead Overseer inspections of critical ICT third-party service providers where those inspections relate to services provided to the financial entity.\n\n6. Financial entities shall ensure that contractual arrangements with critical ICT third-party service providers include provisions allowing Lead Overseer and competent authority inspection access.",
      "obligations": [
        "Facilitate Lead Overseer on-site inspections of critical ICT third-party service providers where required",
        "Participate in Lead Overseer inspection activities when requested",
        "Ensure contracts with critical ICT providers include Lead Overseer inspection access provisions",
        "Ensure contracts include competent authority inspection access provisions",
        "Cooperate with officials authorised to conduct inspections of critical ICT third-party providers"
      ]
    },
    {
      "regulation": "DORA",
      "article": "Article 40",
      "title": "Continuous Oversight",
      "domain": "ICT Third-Party Oversight",
      "text": "1. The Lead Overseer shall draw up an individual oversight plan for each critical ICT third-party service provider covering:\n\n(a) the annual supervisory objectives for the critical ICT third-party service provider, taking into account the ICT third-party service provider's risk profile;\n(b) the key actions planned during the oversight cycle, including the general investigations and on-site inspections planned;\n(c) any other task the Lead Overseer deems appropriate.\n\n2. Following the completion of oversight activities, the Lead Overseer shall issue recommendations to the critical ICT third-party service provider to be complied with within the period specified. Those recommendations shall address:\n(a) technical measures and organisational measures;\n(b) ICT security measures.\n\n3. Where the critical ICT third-party service provider does not comply with the recommendations within the specified period, the Lead Overseer shall notify the competent authorities of the financial entities using the services of that provider.\n\n4. Financial entities shall adapt their use of and reliance on critical ICT third-party service providers based on the outcomes of Lead Overseer oversight activities and recommendations.\n\n5. Financial entities shall monitor competent authority communications regarding the compliance status of their critical ICT third-party service providers.",
      "obligations": [
        "Monitor Lead Overseer oversight plan outcomes and recommendations for critical ICT providers",
        "Adapt use of critical ICT providers based on Lead Overseer oversight findings",
        "Monitor competent authority notifications regarding critical ICT provider non-compliance",
        "Plan contingency responses to potential Lead Overseer non-compliance notifications regarding critical providers",
        "Review contractual arrangements with critical ICT providers in light of oversight findings and recommendations"
      ]
    },
    {
      "regulation": "DORA",
      "article": "Article 41",
      "title": "Harmonisation of Conditions Enabling the Conduct of Oversight Activities",
      "domain": "ICT Third-Party Oversight",
      "text": "The ESAs shall develop, through the Joint Committee, draft regulatory technical standards to specify:\n\n(a) the information to be provided by ICT third-party service providers in the application for voluntary designation as referred to in Article 31;\n(b) the content, structure and format of the information to be submitted, disclosed or reported by critical ICT third-party service providers pursuant to Article 35(1), point (c), and Article 39;\n(c) the criteria for determining the composition of the joint examination team and the modalities for the coordination between the Lead Overseer and the competent authorities in relation to oversight activities, exchanges of information and co-operation tasks;\n(d) the details of competent authorities' cooperation with the Lead Overseer, in particular the type of information to be exchanged;\n(e) the modalities of how financial entities can facilitate exchanges of information to the Lead Overseer during oversight activities.\n\nFinancial entities shall comply with applicable regulatory technical standards developed under this Article, which specify how to facilitate oversight information exchanges between financial entities and Lead Overseers.",
      "obligations": [
        "Comply with RTS requirements on facilitating information exchange with Lead Overseers during oversight activities",
        "Implement processes to efficiently provide information to Lead Overseers in prescribed format and content",
        "Monitor publication of regulatory technical standards governing oversight activity harmonisation",
        "Update internal procedures when RTS requirements on oversight cooperation are published"
      ]
    },
    {
      "regulation": "DORA",
      "article": "Article 42",
      "title": "Follow-up by Competent Authorities",
      "domain": "ICT Third-Party Oversight",
      "text": "1. Without prejudice to the powers of competent authorities under relevant sectoral Union law, where the Lead Overseer has informed a competent authority that a critical ICT third-party service provider has failed to comply with the recommendations issued to it pursuant to Article 40(2), the competent authority shall, where the failure to comply with those recommendations is likely to affect the digital operational resilience of the financial entity using the ICT services of that critical ICT third-party service provider, take the following measures:\n\n(a) direct the financial entity to temporarily suspend, in full or in part, the use of or reliance on the relevant ICT services until the risks identified in the recommendations have been addressed;\n(b) direct the financial entity to terminate, in full or in part, the relevant contractual arrangements with the critical ICT third-party service provider.\n\n2. Where a financial entity has been directed to terminate a contractual arrangement under paragraph 1, point (b), such termination shall take effect in accordance with the applicable terms and conditions of the contractual arrangement and in a manner that limits the disruption to the financial entity's operations.\n\n3. Financial entities shall develop contingency plans and exit strategies to enable orderly termination of critical ICT service relationships when directed to do so by competent authorities.\n\n4. Financial entities shall monitor the compliance status of their critical ICT third-party service providers with Lead Overseer recommendations.",
      "obligations": [
        "Be prepared to suspend use of critical ICT services if directed by competent authority due to provider non-compliance",
        "Be prepared to terminate critical ICT service contractual arrangements if directed by competent authority",
        "Develop contingency plans enabling orderly termination of critical ICT service relationships",
        "Maintain exit strategies for critical ICT third-party service providers",
        "Monitor compliance of critical ICT providers with Lead Overseer recommendations",
        "Ensure exit strategy allows termination without excessive disruption to operations"
      ]
    },
    {
      "regulation": "DORA",
      "article": "Article 43",
      "title": "Oversight Fees",
      "domain": "ICT Third-Party Oversight",
      "text": "1. The Lead Overseer shall charge annual supervisory fees to critical ICT third-party service providers. Those fees shall cover all expenses incurred by the Lead Overseer with respect to the supervision of critical ICT third-party service providers pursuant to this Regulation.\n\n2. The total amount of annual supervisory fees charged to a specific critical ICT third-party service provider shall be proportionate to its size, measured by its annual net revenues received from the provision of ICT services to financial entities in the Union.\n\n3. The ESAs shall develop, by means of delegated acts, the methodology for calculating the supervisory fees and the procedure for the payment of those fees.\n\nFinancial entities should be aware that their critical ICT third-party service providers may seek to recover oversight fees through pricing adjustments in service contracts. Financial entities should review existing and new contracts with critical ICT providers for provisions related to regulatory cost pass-through.",
      "obligations": [
        "Review contractual arrangements with critical ICT providers for provisions related to regulatory oversight fee pass-through",
        "Assess impact of oversight fees on total cost of critical ICT services",
        "Ensure contracts address allocation of regulatory compliance costs including oversight fees",
        "Monitor changes to oversight fee methodology that may affect critical ICT service pricing"
      ]
    },
    {
      "regulation": "DORA",
      "article": "Article 44",
      "title": "International Cooperation",
      "domain": "ICT Third-Party Oversight",
      "text": "1. The ESAs may, in accordance with Article 33 of Regulations (EU) No 1093/2010, No 1094/2010 and No 1095/2010, conclude administrative arrangements with third-country regulatory and supervisory authorities in order to foster international supervisory cooperation.\n\n2. The ESAs shall share information received from third-country authorities with their respective Board of Supervisors and the Oversight Forum.\n\n3. Financial entities subject to DORA and using ICT services from providers in third countries should be aware of international cooperation arrangements that may affect oversight of those providers and of the information that may be shared with third-country authorities.\n\n4. Financial entities should assess the implications of international cooperation frameworks when engaging with ICT third-party service providers established in non-EU jurisdictions, including the potential sharing of information about the financial entity's use of ICT services with third-country regulatory authorities.",
      "obligations": [
        "Be aware of international cooperation agreements affecting oversight of third-country ICT providers",
        "Assess information-sharing implications when using ICT providers in non-EU jurisdictions",
        "Review cross-border data handling and regulatory information sharing provisions in third-country ICT provider contracts",
        "Monitor international cooperation developments that may affect oversight of critical ICT third-party providers"
      ]
    },
    {
      "regulation": "DORA",
      "article": "Article 45",
      "title": "Arrangements for Information Sharing",
      "domain": "Information Sharing",
      "text": "1. Financial entities may exchange amongst themselves cyber threat information and intelligence, including indicators of compromise, tactics, techniques and procedures, cyber security alerts and configuration tools, to the extent that such information and intelligence sharing:\n\n(a) aims to enhance the digital operational resilience of financial entities, in particular through awareness-raising in relation to cyber threats, limiting or impeding the cyber threats' ability to spread, supporting defence capabilities, threat detection techniques, mitigation strategies or response and recovery stages;\n(b) takes place within trusted communities of financial entities;\n(c) is implemented through information-sharing arrangements that protect the potentially sensitive nature of the information shared and is governed by rules of conduct in full respect of business confidentiality, protection of personal data in accordance with Regulation (EU) 2016/679, and guidelines on competition policy.\n\n2. For the purpose of paragraph 1, financial entities shall designate a member of senior management responsible for the implementation and overseeing of the information-sharing arrangements and for reporting to the management body on relevant developments.\n\n3. The information sharing arrangements referred to in paragraph 1 may include, where permissible:\n(a) membership of information-sharing communities;\n(b) sharing of information including indicators of compromise, tactics, techniques and procedures;\n(c) analysis of information;\n(d) threat intelligence.\n\n4. Competent authorities shall be informed of participation in information-sharing arrangements and may request information about the arrangements. Financial entities shall cooperate with competent authorities on matters related to information-sharing arrangements.",
      "obligations": [
        "Participate in trusted community information-sharing arrangements on cyber threats where appropriate",
        "Ensure information-sharing arrangements protect sensitive information and respect business confidentiality",
        "Comply with GDPR requirements when sharing information in cyber threat intelligence arrangements",
        "Designate senior management member responsible for information-sharing arrangement implementation and oversight",
        "Report information-sharing arrangement developments to management body",
        "Inform competent authorities of participation in information-sharing arrangements",
        "Cooperate with competent authorities on matters related to information-sharing",
        "Limit information sharing to aims of enhancing digital operational resilience",
        "Ensure information-sharing operates within trusted communities of financial entities"
      ]
    },
    {
      "regulation": "DORA",
      "article": "Article 46",
      "title": "Designation of Competent Authorities",
      "domain": "Information Sharing",
      "text": "1. Without prejudice to the competence of the European Central Bank regarding specific supervisory tasks conferred on it pursuant to Council Regulation (EU) No 1024/2013, the supervision of compliance with this Regulation shall be carried out by the competent authorities designated in accordance with the relevant sector-specific Union legislation applicable to financial entities.\n\n2. Each Member State shall designate one or more competent authorities responsible for supervising the application of this Regulation in respect of each category of financial entity listed in Article 2(1). Where a Member State designates more than one competent authority, it shall clearly delineate the respective tasks of those authorities and designate a single contact point for international cooperation and supervisory coordination purposes.\n\n3. Financial entities shall identify their designated competent authority under this Regulation and maintain up-to-date records of all competent authorities with jurisdiction over their activities.\n\n4. Competent authorities designated under this Article shall have all supervisory, investigatory and sanctioning powers necessary to fulfil their duties under this Regulation. Their powers shall be exercised in a proportionate and effective manner, having due regard to the size, systemic importance, nature, scale and complexity of the financial entity.",
      "obligations": [
        "Identify and record the competent authority designated to supervise DORA compliance for your entity type and jurisdiction",
        "Maintain up-to-date records of all competent authorities with jurisdiction over your activities",
        "Cooperate fully with your designated competent authority on all DORA-related supervisory activities",
        "Provide information and assistance to the single contact point for international cooperation when requested",
        "Respond promptly to all supervisory enquiries from your designated competent authority"
      ]
    },
    {
      "regulation": "DORA",
      "article": "Article 47",
      "title": "Cooperation among Competent Authorities",
      "domain": "Information Sharing",
      "text": "1. Competent authorities shall cooperate closely with each other and, where relevant, with the Lead Overseers designated under Article 31, including by exchanging all information that is necessary for the purpose of carrying out their duties under this Regulation using their powers whether or not referred to in this Regulation.\n\n2. Competent authorities shall, at least annually, provide the relevant ESAs with aggregated information on all administrative penalties and remedial measures imposed in accordance with this Regulation, indicating the type of breach and the nature of the administrative penalty or remedial measure imposed.\n\n3. Financial entities shall cooperate with their competent authority in the facilitation of supervisory cooperation between authorities from different Member States or jurisdictions.\n\n4. Where a financial entity operates in multiple Member States, competent authorities concerned shall exchange information and coordinate supervisory activities to ensure consistent application of this Regulation. Financial entities must designate a clear contact point for each relevant competent authority.",
      "obligations": [
        "Cooperate with all competent authorities from Member States where you operate or provide services",
        "Designate a clear internal contact point for each relevant competent authority",
        "Facilitate information exchange between competent authorities when requested",
        "Respond to supervisory requests from competent authorities from other Member States where relevant",
        "Support cross-border supervisory coordination activities as required"
      ]
    },
    {
      "regulation": "DORA",
      "article": "Article 48",
      "title": "Cooperation with EBA, ESMA and EIOPA",
      "domain": "Information Sharing",
      "text": "1. The competent authorities designated pursuant to Article 46 shall cooperate closely with the European Banking Authority (EBA), the European Securities and Markets Authority (ESMA) and the European Insurance and Occupational Pensions Authority (EIOPA) (together, the 'ESAs') on all matters relating to the application of this Regulation.\n\n2. Without delay and on a voluntary basis, financial entities that detect a significant cyber threat shall notify the relevant competent authority thereof. The competent authority may in turn transmit information to relevant ESAs, Lead Overseers and relevant public authorities where warranted by the systemic nature of the threat.\n\n3. Financial entities shall provide ESAs with all information required for the performance of their duties under this Regulation upon request.\n\n4. ESAs shall develop common regulatory technical standards (RTS) and implementing technical standards (ITS) to give practical effect to DORA's requirements. Financial entities must comply with all RTS and ITS adopted pursuant to this Regulation.",
      "obligations": [
        "Voluntarily and promptly notify competent authorities of significant cyber threats detected",
        "Provide all information requested by ESAs (EBA, ESMA, EIOPA) for performance of their duties",
        "Comply with all Regulatory Technical Standards (RTS) and Implementing Technical Standards (ITS) adopted under DORA",
        "Monitor and implement ESA guidelines and recommendations relevant to your entity type",
        "Support ESA supervisory convergence initiatives and respond to ESA information-gathering exercises"
      ]
    },
    {
      "regulation": "DORA",
      "article": "Article 49",
      "title": "Cooperation with Third-Country Authorities",
      "domain": "Information Sharing",
      "text": "1. Competent authorities may conclude administrative cooperation arrangements with supervisory authorities of third countries in the area of digital operational resilience, including information exchange and mutual assistance in supervisory activities.\n\n2. Financial entities operating in both Member States and third countries shall facilitate the exchange of supervisory information between competent authorities and third-country supervisory authorities, to the extent permitted by applicable law and contractual arrangements.\n\n3. Where relevant, competent authorities shall inform their counterpart third-country authorities of significant ICT incidents affecting financial entities operating in those countries. Financial entities shall cooperate with this cross-border information flow.\n\n4. Financial entities that are subsidiaries of third-country groups shall ensure that group-level DORA compliance information is available to their Union competent authorities, even where the parent entity is established outside the Union.",
      "obligations": [
        "Facilitate exchange of supervisory information between Union and third-country supervisory authorities when requested",
        "Ensure group-level DORA compliance information is accessible to Union competent authorities for third-country group subsidiaries",
        "Cooperate with cross-border information exchange on significant ICT incidents affecting multi-jurisdiction operations",
        "Maintain records of cross-border ICT service dependencies that may be relevant to third-country supervisory cooperation",
        "Ensure contractual arrangements with ICT providers support necessary cross-border supervisory disclosure"
      ]
    },
    {
      "regulation": "DORA",
      "article": "Article 50",
      "title": "Administrative Penalties and Remedial Measures",
      "domain": "ICT Third-Party Oversight",
      "text": "1. Competent authorities shall have all supervisory and investigatory powers necessary to fulfil their duties under this Regulation. These include:\n\n(a) access to any document, data, procedure or any other material in any format, wherever stored;\n(b) on-site inspections or investigations at any business premises, land or property;\n(c) requests for explanations from management body members and staff;\n(d) interim measures in accordance with national law where there is immediate and significant risk to financial stability;\n(e) temporary bans on any person from exercising managerial responsibilities;\n(f) requirements to adopt measures to bring conduct into conformity with this Regulation, and to cease conduct that is in breach of this Regulation.\n\n2. Without prejudice to the right to provide explanations, financial entities shall cooperate with competent authority investigations, on-site inspections and information requests. Obstruction of supervisory activities is a breach of this Regulation.\n\n3. Financial entities must implement remedial measures within the timeframes specified by the competent authority.",
      "obligations": [
        "Provide competent authorities with access to all documents, data, procedures and materials in any format requested",
        "Cooperate fully with on-site inspections and investigations at business premises",
        "Ensure management body members and staff respond to competent authority requests for explanations",
        "Implement all remedial measures within timeframes specified by the competent authority",
        "Refrain from obstructing supervisory activities — obstruction constitutes a breach of DORA",
        "Comply with interim measures ordered by competent authorities in cases of significant risk to financial stability",
        "Cease any conduct determined by the competent authority to be in breach of this Regulation"
      ]
    },
    {
      "regulation": "DORA",
      "article": "Article 51",
      "title": "Administrative Penalties",
      "domain": "ICT Third-Party Oversight",
      "text": "1. Without prejudice to the right of competent authorities to impose supervisory measures, Member States shall lay down rules on administrative penalties and other administrative measures applicable to breaches of this Regulation and shall take all measures necessary to ensure that they are implemented.\n\n2. Administrative penalties for financial entities that are legal persons shall not exceed:\n(a) EUR 10,000,000 or, if higher, 2% of the total annual worldwide turnover according to the latest available accounts for breaches of the ICT risk management, incident reporting, resilience testing, and third-party risk management requirements;\n(b) EUR 5,000,000 for natural persons.\n\n3. When determining the appropriate administrative penalty, competent authorities shall take into account all relevant circumstances, including:\n(a) the gravity and the duration of the breach;\n(b) the degree of responsibility of the natural or legal person;\n(c) the financial strength of the natural or legal person responsible;\n(d) the importance of profits gained or losses avoided;\n(e) the losses incurred by third parties as a result of the breach;\n(f) the level of cooperation with the competent authority;\n(g) previous breaches;\n(h) any remedial measures adopted.\n\n4. Competent authorities may publish administrative penalties imposed.",
      "obligations": [
        "Maintain full compliance with ICT risk management requirements to avoid penalties of up to EUR 10,000,000 or 2% of global annual turnover",
        "Ensure management individuals are aware of personal liability of up to EUR 5,000,000 for DORA breaches",
        "Demonstrate cooperation with competent authority as a mitigating factor in any penalty proceedings",
        "Adopt and document remedial measures promptly to reduce penalty exposure",
        "Maintain records demonstrating compliance efforts to support proportionality arguments in enforcement proceedings",
        "Ensure board-level awareness of DORA penalty regime and financial exposure"
      ]
    },
    {
      "regulation": "DORA",
      "article": "Article 52",
      "title": "Criminal Sanctions",
      "domain": "ICT Third-Party Oversight",
      "text": "1. Where Member States have decided, in accordance with national law, to lay down criminal sanctions for breaches of provisions that are subject to administrative penalties under this Regulation, they shall ensure that appropriate measures are in place so that competent authorities have all necessary powers to liaise with judicial, prosecuting or criminal justice authorities within their jurisdiction to receive specific information related to criminal investigations or proceedings commenced for breaches of this Regulation.\n\n2. Natural persons responsible for DORA breaches within financial entities may face both criminal sanctions (where provided by national law) and administrative penalties, without prejudice to the non bis in idem principle.\n\n3. Financial entities shall maintain internal governance frameworks that attribute clear individual responsibility for DORA compliance, enabling identification of responsible natural persons in enforcement proceedings.\n\n4. Competent authorities shall cooperate with criminal justice authorities where criminal proceedings arise from DORA breaches. Financial entities shall cooperate with both regulatory and criminal investigations.",
      "obligations": [
        "Maintain internal governance frameworks that clearly attribute individual responsibility for DORA compliance obligations",
        "Ensure senior management and board members are personally aware of potential criminal liability for DORA breaches under national law",
        "Cooperate with criminal justice authorities in any investigation related to DORA breaches",
        "Implement documented escalation procedures ensuring rapid disclosure of potential DORA breaches to board level",
        "Maintain records demonstrating personal compliance oversight by responsible individuals",
        "Ensure legal counsel is engaged to assess national criminal sanction provisions applicable to DORA breaches"
      ]
    },
    {
      "regulation": "DORA-RTS",
      "article": "RTS-RM-01",
      "title": "RTS on ICT Risk Management — Asset Management, Change Control and Cryptography",
      "domain": "ICT Risk Management",
      "text": "Commission Delegated Regulation (EU) 2024/1774 (13 March 2024) provides detailed technical requirements implementing DORA Articles 5–16. Key provisions:\n\n1. ICT Asset Management: Financial entities must maintain a complete, continuously updated inventory of all ICT assets (hardware, software, data repositories, network components, cloud resources, and mobile devices). Each asset must record its owner, classification, location, and interdependencies. Assets supporting critical or important functions must be tagged and subject to enhanced controls.\n\n2. Change Management: All ICT changes (upgrades, patches, configuration modifications) must follow a documented change management procedure encompassing: change request, risk assessment, approval by authorised personnel, testing in a non-production environment, rollback plan, and post-change validation. Emergency changes require retrospective documentation.\n\n3. Encryption and Key Management: Data at rest and in transit supporting critical or important functions must be encrypted using current cryptographic standards. Financial entities must maintain a documented key management policy covering key generation, distribution, storage, rotation, revocation, and destruction. Hardware Security Modules (HSMs) are recommended for high-assurance key storage.\n\n4. Endpoint and Network Security: Entities must deploy and maintain endpoint detection and response (EDR) solutions, network access control, intrusion detection and prevention systems (IDS/IPS), and network segmentation using firewalls and DMZ architectures. All external-facing interfaces must be protected by web application firewalls (WAF) or equivalent controls.\n\n5. Vulnerability Management: A formal vulnerability and patch management programme must define SLA targets: critical vulnerabilities (CVSS ≥9.0) remediated within 1 month, high (CVSS 7.0–8.9) within 3 months, medium within 6 months. Regular vulnerability scanning (minimum quarterly for internet-facing systems) and penetration testing are required.",
      "obligations": [
        "Maintain a continuously updated ICT asset inventory covering all hardware, software, data, networks, cloud and mobile assets",
        "Classify all ICT assets and apply enhanced controls for those supporting critical or important functions",
        "Implement a documented change management procedure including risk assessment, non-production testing, approval, rollback plan and post-change validation",
        "Encrypt all data at rest and in transit for critical or important functions using current cryptographic standards",
        "Maintain a documented cryptographic key management policy covering generation, distribution, storage, rotation, revocation and destruction",
        "Deploy endpoint detection and response (EDR), network access control, IDS/IPS, and network segmentation controls",
        "Protect all external-facing interfaces with WAF or equivalent controls",
        "Define and enforce patching SLAs: critical (CVSS ≥9.0) within 1 month, high within 3 months, medium within 6 months",
        "Conduct minimum quarterly vulnerability scanning on internet-facing systems",
        "Document all ICT security policies and review them at least annually"
      ]
    },
    {
      "regulation": "DORA-RTS",
      "article": "RTS-IR-01",
      "title": "RTS on Classification of ICT-related Incidents — Major Incident Thresholds",
      "domain": "Incident Reporting",
      "text": "Commission Delegated Regulation (EU) 2024/1772 specifies the classification criteria for determining whether an ICT-related incident must be reported to competent authorities as a 'major ICT-related incident' under DORA Article 18. An incident is major if it meets one or more of the following threshold criteria:\n\n1. Clients affected: The incident directly affects more than 10% of the financial entity's total client base, or more than 1,000 clients, whichever is lower.\n\n2. Service unavailability: The incident causes service disruption for critical or important functions lasting more than 4 consecutive hours, or causes repeated interruptions totalling more than 4 hours in a 24-hour period.\n\n3. Data breach impact: The incident results in the loss, corruption or unavailability of data representing more than 0.1% of the financial entity's total client records, or more than 1,000 individual client records, whichever is lower.\n\n4. Reputational damage: The incident results in significant media coverage or triggers a formal enquiry from a competent authority or law enforcement body.\n\n5. Geographic spread: The incident affects ICT infrastructure or services in more than two Member States simultaneously.\n\n6. Financial impact: The incident causes direct financial losses exceeding EUR 1,000,000 or equivalent in other currencies.\n\n7. Systemic risk: The incident, even if below the quantitative thresholds, has the potential to propagate to other financial entities or to financial market infrastructure.\n\nFinancial entities must assess incidents against all seven criteria at the time of initial detection and at each subsequent review point.",
      "obligations": [
        "Assess every ICT-related incident against all seven major incident classification criteria within the initial detection period",
        "Classify as major if more than 10% of clients or more than 1,000 clients are affected",
        "Classify as major if service disruption to critical functions exceeds 4 consecutive hours",
        "Classify as major if data breach affects more than 0.1% of client records or more than 1,000 records",
        "Classify as major if the incident receives significant media coverage or triggers regulatory enquiry",
        "Classify as major if the incident affects infrastructure in more than two Member States",
        "Classify as major if direct financial losses exceed EUR 1,000,000",
        "Assess systemic risk potential even when quantitative thresholds are not met",
        "Re-assess incident classification at each review point as new information becomes available",
        "Document the classification rationale for every ICT incident regardless of whether it is major"
      ]
    },
    {
      "regulation": "DORA-RTS",
      "article": "RTS-IR-02",
      "title": "ITS on Major Incident Reporting — Templates, Timelines and Content",
      "domain": "Incident Reporting",
      "text": "The Implementing Technical Standards on reporting templates and timelines (adopted under DORA Article 20) establish the following mandatory reporting obligations for major ICT-related incidents:\n\n1. Initial Notification (within 4 hours of classification as major): Financial entities must submit an initial notification to their competent authority containing: incident identifier, date and time of detection and classification, preliminary description of the incident, affected business lines and geographic scope, estimated number of clients affected, preliminary assessment of financial impact, and immediate containment measures applied. The 4-hour deadline runs from the moment the incident is classified as major, not from initial detection.\n\n2. Intermediate Report (within 72 hours of initial notification): The intermediate report must include: updated assessment of incident scope and impact, root cause analysis if available, containment and recovery measures implemented, revised estimate of client and financial impact, business continuity measures activated, and current status of the incident.\n\n3. Final Report (within 1 month of incident resolution): The final report must include: complete root cause analysis, full timeline from detection to resolution, total number of clients affected, total direct and indirect financial losses, all corrective and preventive measures implemented or planned, lessons learned, and a forward-looking resilience improvement plan.\n\n4. Voluntary Notification: Financial entities may voluntarily notify competent authorities of significant cyber threats that have not yet caused an incident but that could escalate. Voluntary notifications should follow the initial notification format.\n\n5. Reporting to clients: Financial entities must notify affected clients of major ICT incidents without undue delay and in a clear, non-technical manner.",
      "obligations": [
        "Submit initial notification to competent authority within 4 hours of classifying an incident as major",
        "Include incident ID, timeline, preliminary description, affected business lines, and client impact estimate in the initial notification",
        "Submit an intermediate report within 72 hours of the initial notification with updated scope, root cause analysis and recovery measures",
        "Submit a final report within 1 month of incident resolution including full root cause analysis, financial impact, and lessons learned",
        "Maintain an incident register with unique identifiers for all ICT-related incidents regardless of classification",
        "Report voluntarily on significant cyber threats that have not yet caused an incident using the initial notification format",
        "Notify affected clients without undue delay and in plain language when a major ICT incident affects their services",
        "Ensure all three report types (initial, intermediate, final) use the competent authority's prescribed templates"
      ]
    },
    {
      "regulation": "DORA-RTS",
      "article": "RTS-TLPT-01",
      "title": "RTS on Threat-Led Penetration Testing (TLPT) — Requirements and Methodology",
      "domain": "Resilience Testing",
      "text": "The Joint Committee Final Report JC 2023 86 (RTS on TLPT under DORA Article 26) establishes requirements for Threat-Led Penetration Testing based on the TIBER-EU framework. Key provisions:\n\n1. Scope of application: TLPT applies to financial entities identified by competent authorities as significant based on their systemic importance, interconnectedness, and complexity. Competent authorities identify in-scope entities at least every 3 years.\n\n2. Testing frequency: In-scope financial entities must conduct TLPT at least every 3 years on systems, applications and infrastructure supporting critical or important functions.\n\n3. Methodology: TLPT must follow a three-phase approach: (a) Threat Intelligence phase — commissioned from an approved Threat Intelligence provider, produces a Targeted Threat Intelligence report identifying the most likely attack scenarios; (b) Red Team phase — a certified red team provider executes realistic attack simulations based on the threat intelligence, targeting live production systems; (c) Closure phase — findings are validated with the blue team, remediation plans documented, and a formal test report produced.\n\n4. Tester requirements: Red team providers must be certified by the competent authority or a recognised certification body. Internal red teams may be used if they meet independence requirements.\n\n5. Pooled testing: Where multiple financial entities share the same ICT infrastructure or service providers, competent authorities may authorise joint TLPT exercises.\n\n6. ICT third-party participation: ICT third-party service providers supporting critical or important functions may be required to participate in and support TLPT exercises.\n\n7. Remediation: Financial entities must produce a documented remediation plan addressing all TLPT findings within 3 months of test completion and report progress to the competent authority.",
      "obligations": [
        "Determine whether your entity is in scope for TLPT based on competent authority designation criteria",
        "Conduct TLPT at least every 3 years if designated as in-scope by the competent authority",
        "Commission Targeted Threat Intelligence from an approved provider before commencing red team testing",
        "Engage a certified red team provider to conduct realistic attack simulations on live production systems",
        "Ensure TLPT covers all systems, applications and infrastructure supporting critical or important functions",
        "Require ICT third-party service providers supporting critical functions to participate in and support TLPT exercises",
        "Produce a documented remediation plan addressing all TLPT findings within 3 months of test completion",
        "Report TLPT results and remediation progress to the competent authority in prescribed format",
        "Retain all TLPT documentation (threat intelligence, red team report, remediation plan) for at least 5 years",
        "Consider pooled TLPT arrangements where shared ICT infrastructure is used across financial entities"
      ]
    },
    {
      "regulation": "DORA-RTS",
      "article": "RTS-TPR-01",
      "title": "RTS on ICT Third-Party Risk — Due Diligence, Assessment and Oversight",
      "domain": "Third-Party Risk",
      "text": "The EBA Final Report EBA/RTS/2024/05 on RTS on ICT third-party risk establishes detailed requirements for the assessment, management and ongoing oversight of ICT third-party service providers under DORA Articles 28–30. Key provisions:\n\n1. Pre-contracting due diligence: Before entering any ICT arrangement supporting critical or important functions, financial entities must conduct a documented risk assessment covering: the provider's ICT security posture and certifications (ISO 27001, SOC 2 Type II), business continuity and disaster recovery capabilities (RTO/RPO commitments, DR test results), subcontracting chain and data processing locations, financial stability and operational resilience track record, regulatory standing and any enforcement actions in the past 5 years, and reference checks with other financial entity clients.\n\n2. Proportionate assessment: The depth of due diligence must be proportionate to the criticality of the function. Providers supporting critical or important functions require enhanced due diligence; standard functions require lighter-touch assessment.\n\n3. Concentration risk assessment (Article 29): Before contracting with a provider already serving multiple financial entities, the financial entity must assess: the provider's overall market share in the relevant service category, the number and systemic importance of other financial entity clients, geographic concentration of infrastructure, and the entity's ability to substitute the provider within an acceptable timeframe.\n\n4. Ongoing monitoring: ICT third-party service providers supporting critical or important functions must be subject to: annual formal performance and security reviews, continuous monitoring of service levels against contractual KPIs, tracking of audit findings and remediation progress, and incident notification monitoring.\n\n5. Exit testing: Financial entities must annually test their exit plans for critical ICT service providers through tabletop exercises and, at least every 3 years, operational exit drills.\n\n6. Documentation retention: All due diligence records, assessments, and monitoring documentation must be retained for a minimum of 5 years.",
      "obligations": [
        "Conduct documented pre-contracting risk assessment for all ICT arrangements supporting critical or important functions",
        "Assess provider ICT security posture, certifications, BCP/DR capabilities, subcontracting chain, financial stability and regulatory standing before contracting",
        "Apply proportionate due diligence: enhanced for critical functions, standard for non-critical arrangements",
        "Assess concentration risk (Art.29) before contracting with providers already serving multiple financial entities",
        "Conduct annual formal performance and security reviews for all providers supporting critical or important functions",
        "Monitor service levels continuously against contractual KPIs and track audit finding remediation",
        "Test exit plans via tabletop exercises annually and operational drills at least every 3 years",
        "Retain all due diligence records, assessments, contracts and monitoring documentation for minimum 5 years",
        "Include all critical and important function ICT providers in the Register of Information (Art.28(3))",
        "Report concentration risk findings to the management body and competent authority when thresholds are exceeded"
      ]
    },
    {
      "regulation": "DORA-RTS",
      "article": "RTS-ROI-01",
      "title": "RTS/ITS on Register of Information — Content, Format and Reporting",
      "domain": "Third-Party Risk",
      "text": "The EBA Implementing Technical Standards on the Register of Information (RoI) under DORA Article 28(3) establish the mandatory format and content requirements for the ICT third-party service provider register that financial entities must maintain and submit to competent authorities. The RoI follows the EBA Master Template structure:\n\n1. RT.01.01 — General Overview: One row per financial entity reporting. Contains: LEI code, entity name, competent authority, reporting period, total number of ICT third-party service providers, number of providers supporting critical or important functions.\n\n2. RT.02.01 — ICT Third-Party Service Providers: One row per ICT provider arrangement. Contains: provider name, provider LEI (if applicable), country of establishment, provider type (cloud, software, data, network, other), start and end dates of arrangement, service description, criticality classification (critical, important, standard), vendor status (active, under review, exited), ICT function categories supported, next review date, and exit strategy reference.\n\n3. RT.03.01 — Contractual Arrangements: One row per contract. Contains: contract reference, signing date, governing law jurisdiction, notice periods for termination, SLA metrics committed, audit rights provisions, and data location commitments.\n\n4. RT.04.01 — Certifications: One row per certification per provider. Contains: certification type (ISO 27001, SOC 2, CSA-STAR, ISO 22301), issuing body, certification date, expiry date, and current status (valid, expiring-soon, expired).\n\n5. RT.05.01 — Cloud Services: One row per cloud arrangement. Contains: cloud service model (IaaS, PaaS, SaaS), deployment model (public, private, hybrid), data processing regions, and multi-cloud strategy details.\n\n6. Submission frequency: The RoI must be submitted to the competent authority at least annually and upon material changes. Competent authorities may request ad-hoc submissions at any time.\n\n7. Data quality: Financial entities are responsible for the accuracy and completeness of all RoI data. Incorrect submissions may constitute a breach of DORA Article 28.",
      "obligations": [
        "Maintain a complete Register of Information covering all ICT third-party service provider arrangements",
        "Populate all five EBA Master Template sheets: RT.01.01, RT.02.01, RT.03.01, RT.04.01, RT.05.01",
        "Include provider LEI codes, country of establishment, service type, and criticality classification for every provider",
        "Record contract details including governing law, notice periods, SLA metrics, and audit rights",
        "Track all provider certifications (ISO 27001, SOC 2, CSA-STAR, ISO 22301) with expiry dates and status",
        "Document cloud services with service model, deployment model, and data processing regions",
        "Submit the Register of Information to the competent authority at least annually",
        "Update and resubmit the RoI upon any material change to ICT third-party arrangements",
        "Ensure accuracy and completeness of all RoI data — inaccurate submissions may constitute a DORA breach",
        "Retain the RoI and all supporting documentation for a minimum of 5 years"
      ]
    }
  ]
}